<header style="padding:1px;background:#f9f9f9;border-top:3px solid #00b2b1"><img id="Teradata-logo" src="https://www.teradata.com/Teradata/Images/Rebrand/Teradata_logo-two_color.png" alt="Teradata" width="220" align="right" />

<b style = 'font-size:28px;font-family:Arial;color:#E37C4D'>Date and Time functions in teradataml.</b>
</header>

### Disclaimer
The sample code (“Sample Code”) provided is not covered by any Teradata agreements. Please be aware that Teradata has no control over the model responses to such sample code and such response may vary. The use of the model by Teradata is strictly for demonstration purposes and does not constitute any form of certification or endorsement. The sample code is provided “AS IS” and any express or implied warranties, including the implied warranties of merchantability and fitness for a particular purpose, are disclaimed. In no event shall Teradata be liable for any direct, indirect, incidental, special, exemplary, or consequential damages (including, but not limited to, procurement of substitute goods or services; loss of use, data, or profits; or business interruption) sustained by you or a third party, however caused and on any theory of liability, whether in contract, strict liability, or tort arising in any way out of the use of this sample code, even if advised of the possibility of such damage.

<html lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=utf-8">
</head><body>
<b style = 'font-size:28px;font-family:Arial;color:#E37C4D'>List of available Date and Time functions in teradataml.</b>
 <ul style="list-style-type:disc;">
 <li><h3>  week_start, week_begin </h3>    Returns  the  first  date  or  timestamp  of  the  week  that  begins  immediately  before  the  specified  date  or  timestamp  value  in  a  column  as  a  literal.</li>
 <li><h3>  week_end </h3>    Returns  the  last  date  or  timestamp  of  the  week  that  ends  immediately  after  the  specified  date  or  timestamp  value  in  a  column  as  a  literal.</li>
 <li><h3>  month_start, month_begin </h3>    Returns  the  first  date  or  timestamp  of  the  month  that  begins  immediately  before  the  specified  date  or  timestamp  value  in  a  column  or  as  a  literal.</li>
 <li><h3>  month_end </h3>    Returns  the  last  date  or  timestamp  of  the  month  that  ends  immediately  after  the  specified  date  or  timestamp  value  in  a  column  or  as  a  literal.</li>
 <li><h3>  year_start, year_begin </h3>    Returns  the  first  date  or  timestamp  of  the  year  that  begins  immediately  before  the  specified  date  or  timestamp  value  in  a  column  or  as  a  literal.</li>
 <li><h3>  year_end </h3>    Returns  the  last  date  or  timestamp  of  the  year  that  ends  immediately  after  the  specified  date  or  timestamp  value  in  a  column  or  as  a  literal.</li>
 <li><h3>  quarter_start, quarter_begin </h3>    Returns  the  first  date  or  timestamp  of  the  quarter  that  begins  immediately  before  the  specified  date  or  timestamp  value  in  a  column  as  a  literal.</li>
 <li> <h3>  quarter_end </h3>    Returns  the  last  date  or  timestamp  of  the  quarter  that  ends  immediately  after  the  specified  date  or  timestamp  value  in  a  column  as  a  literal.</li>
 <li><h3>  last_sunday </h3>    Returns  the  date  or  timestamp  of  Sunday  that  falls  immediately  before  the  specified  date  or  timestamp  value  in  a  column  as  a  literal.</li>
 <li><h3>  last_monday </h3>    Returns  the  date  or  timestamp  of  Monday  that  falls  immediately  before  the  specified  date  or  timestamp  value  in  a  column  as  a  literal.</li>
 <li><h3>  last_tuesday </h3>    Returns  the  date  or  timestamp  of  Tuesday  that  falls  immediately  before  the  specified  date  or  timestamp  value  in  a  column  as  a  literal.</li>
 <li><h3>  last_wednesday </h3>    Returns  the  date  or  timestamp  of  Wednesday  that  falls  immediately  before  specified  date  or  timestamp  value  in  a  column  as  a  literal.</li>
 <li><h3>  last_thursday </h3>    Returns  the  date  or  timestamp  of  Thursday  that  falls  immediately  before  specified  date  or  timestamp  value  in  a  column  as  a  literal.</li>
 <li><h3>  last_friday </h3>    Returns  the  date  or  timestamp  of  Friday  that  falls  immediately  before  specified  date  or  timestamp  value  in  a  column  as  a  literal.</li>
 <li><h3>  last_saturday </h3>    Returns  the  date  or  timestamp  of  Saturday  that  falls  immediately  before  specified  date  or  timestamp  value  in  a  column  as  a  literal.</li>
 <li><h3>  day_of_week </h3>    Returns  the  number  of  days  from  the  beginning  of  the  week  to  the  specified  date  or  timestamp  value  in  a  column  as  a  literal.</li>
 <li><h3>  day_of_month </h3>    Returns  the  number  of  days  from  the  beginning  of  the  month  to  the  specified  date  or  timestamp  value  in  a  column  as  a  literal.</li>
 <li><h3>  day_of_year </h3>    Returns  the  number  of  days  from  the  beginning  of  the  year  to  the  specified  date  or  timestamp  value  in  a  column  as  a  literal.</li>
 <li><h3>  day_of_calendar </h3>    Returns  the  number  of  days  from  the  beginning  of  the  business  calendar  to  the  specified  date  or  timestamp  value  in  a  column  as  a  literal.</li>
 <li><h3>  week_of_month </h3>    Returns  the  number  of  weeks  from  the  beginning  of  the  month  to  the  specified  date  or  timestamp  value  in  a  column  as  a  literal.</li>
 <li><h3>  week_of_quarter </h3>    Returns  the  number  of  weeks  from  the  beginning  of  the  quarter  to  the  specified  date  or  timestamp  value  in  a  column  as  a  literal.</li>
 <li><h3>  week_of_year </h3>    Returns  the  number  of  weeks  from  the  beginning  of  the  year  to  the  specified  date  or  timestamp  value  in  a  column  as  a  literal.</li>
 <li><h3>  week_of_calendar </h3>    Returns  the  number  of  weeks  from  the  beginning  of  the  calendar  to  the  specified  date  or  timestamp  value  in  a  column  as  a  literal.</li>
 <li><h3>  month_of_year </h3>    Returns  the  number  of  months  from  the  beginning  of  the  year  to  the  specified  date  or  timestamp  value  in  a  column  as  a  literal.</li>
 <li><h3>  month_of_calendar </h3>    Returns  the  number  of  months  from  the  beginning  of  the  calendar  to  the  specified  date  or  timestamp  value  in  a  column  as  a  literal.</li>
 <li><h3>  month_of_quarter </h3>    Returns  the  number  of  months  from  the  beginning  of  the  quarter  to  the  specified  date  or  timestamp  value  in  a  column  as  a  literal.</li>
 <li><h3>  quarter_of_year </h3>    Returns  the  number  of  quarters  from  the  beginning  of  the  year  to  the  specified  date  or  timestamp  value  in  a  column  as  a  literal.</li>
 <li><h3>  quarter_of_calendar </h3>    Returns  the  number  of  quarters  from  the  beginning  of  the  calendar  to  the  specified  date  or  timestamp  value  in  a  column  as  a  literal.</li>
 <li><h3>  year_of_calendar </h3>    Returns  the  year  of  the  specified  date  or  timestamp  value  in  a  column  as  a  literal.</li>
 <li><h3>  day_occurrence_of_month </h3>    Returns  the  nth  occurrence  of  the  weekday  in  the  month  for  the  date  to  the  specified  date  or  timestamp  value  in  a  column  as  a  literal.</li>
 <li><h3>  year </h3>    Returns  the  integer  value  for  year  in  the  specified  date  or  timestamp  value  in  a  column  as  a  literal.</li>
 <li><h3>  month </h3>    Returns  the  integer  value  for  month  in  the  specified  date  or  timestamp  value  in  a  column  as  a  literal.</li>
 <li><h3>  hour </h3>    Returns  the  integer  value  for  hour  in  the  specified  timestamp  value  in  a  column  as  a  literal.</li>
 <li><h3>  minute </h3>    Returns  the  integer  value  for  minute  in  the  specified  timestamp  value  in  a  column  as  a  literal.</li>
 <li><h3>  second </h3>    Returns  the  integer  value  for  seconds  in  the  specified  timestamp  value  in  a  column  as  a  literal.</li>
 <li><h3>  week </h3>    Returns  the  number  of  weeks  from  the  beginning  of  the  year  to  the  specified  date  or  timestamp  value  in  a  column  as  a  literal.</li>
 <li><h3>  next_day </h3>    Returns  the  date  of  the  first  weekday  specified  as  'day_value'  that  is  later  than  the  specified  date  or  timestamp  value  in  a  column  as  a  literal.</li>
 <li><h3>  months_between </h3>    Returns  the  number  of  months  between  value  in  specified  date  or  timestamp  value  in  a  column  as  a  literal  and  date  or  timestamp  value  in  argument.</li>
 <li><h3>  add_months </h3>    Adds  an  integer  number  of  months  to  specified  date  or  timestamp  value  in  a  column  as  a  literal.</li>
 <li><h3>  oadd_months </h3>    Adds  an  integer  number  of  months,  date  or  timestamp  value  in  specified  date  or  timestamp  value  in  a  column  as  a  literal.</li>
 <li><h3>  to_timestamp </h3>   Converts  string  or  integer  value  to  a  TIMESTAMP  data  type  or  TIMESTAMP  WITH  TIME  ZONE  data  type.</li>
 <li><h3>  extract </h3>   Extracts  date  component.</li>
 <li><h3>  to_interval </h3>   Converts  a  numeric  value  or  string  value  into  an  INTERVAL_DAY_TO_SECOND  or  INTERVAL_YEAR_TO_MONTH  value.</li>
 <li><h3>  trunc </h3>   Function  to truncate  hours, minutes and seconds from a Date </li>
 <li><h3>  round </h3>   Function  to round the hours, minutes and seconds from a Date </li>     
 <li><h3>  to_date </h3>   Convert  a  stringlike  representation  of  a  DATE  or  PERIOD  type  to  Date  type.</li>
 <li><h3>Convert a date to string and string to date.</h3> Use cast function to convert date to string or string to date.</li>
 <li><h3>Arithmetic operations on date.</h3> Use trunc and round function.</li>
 <li><h3>Add Seconds, Minutes, Days, Hours to date.</h3> Use INTERVAL_MINUTE, INTERVAL_SECOND, INTERVAL_YEAR, INTERVAL_MONTH, INTERVAL_DAY, INTERVAL_HOUR.</li>
</ul><br>
</body>
</html>

<hr>
<b style = 'font-size:28px;font-family:Arial;color:#E37C4D'>Import libraries and create connection. Also prepare the dataset to use in examples.</b>

In [2]:
import getpass
import random
from teradataml import *
from teradataml.dataframe.sql_functions import case

# Get the connection to the Vantage using create_context()
td_context = create_context(host=getpass.getpass("Hostname: "), username=getpass.getpass("Username: "), password=getpass.getpass("Password: "))

# Load the example dataset.
load_example_data("dataframe", ["sales"])
df = DataFrame.from_table('sales')

# Preparing the data 
df_sales = df.assign(dates = case([(df.accounts == 'Alpha Co', df.datetime + random.randrange(20,1000,3)),
                                   (df.accounts == 'Blue Inc', df.datetime + random.randrange(20,1000,3)),
                                   (df.accounts == 'Jones LLC', df.datetime + random.randrange(20,1000,3)),
                                   (df.accounts == 'Orange Inc', df.datetime + random.randrange(20,1000,3)),
                                   (df.accounts == 'Yellow Inc', df.datetime + random.randrange(20,1000,3)),
                                   (df.accounts == 'Red Inc', df.datetime + random.randrange(20,1000,3))]))

Hostname:  ········
Username:  ········
Password:  ········

WARNING: Skipped loading table sales since it already exists in the database.

In [3]:
from IPython.core.display import display
def print_variables(df):
    print("Equivalent SQL: {}".format(df.show_query()))
    print("\n")
    print(" ************************* DataFrame ********************* ")
    display(df)
    print("\n\n")
    print(" ************************* DataFrame.dtypes ********************* ")
    display(df.dtypes)
    print("\n\n")

In [4]:
print_variables(df_sales)

Equivalent SQL: select accounts AS accounts, "Feb" AS "Feb", "Jan" AS "Jan", "Mar" AS "Mar", "Apr" AS "Apr", datetime AS datetime, CASE WHEN (accounts = 'Alpha Co') THEN datetime + 191 WHEN (accounts = 'Blue Inc') THEN datetime + 56 WHEN (accounts = 'Jones LLC') THEN datetime + 440 WHEN (accounts = 'Orange Inc') THEN datetime + 395 WHEN (accounts = 'Yellow Inc') THEN datetime + 362 WHEN (accounts = 'Red Inc') THEN datetime + 233 END AS dates from "sales"


 ************************* DataFrame *********************

              Feb    Jan    Mar    Apr    datetime     dates
accounts
Blue Inc     90.0   50.0   95.0  101.0  04/01/2017  17/03/01
Red Inc     200.0  150.0  140.0    NaN  04/01/2017  17/08/25
Yellow Inc   90.0    NaN    NaN    NaN  04/01/2017  18/01/01
Jones LLC   200.0  150.0  140.0  180.0  04/01/2017  18/03/20
Orange Inc  210.0    NaN    NaN  250.0  04/01/2017  18/02/03
Alpha Co    210.0  200.0  215.0  250.0  04/01/2017  17/07/14

 ************************* DataFrame.dtypes *********************

accounts              str
Feb                 float
Jan                   int
Mar                   int
Apr                   int
datetime    datetime.date
dates       datetime.date

### DataFrameColumn.week_begin()

In [5]:
# Returns the first date or timestamp of the week that begins immediately before the specified date or timestamp value in a column as a literal.
df = df_sales.assign(res = df_sales.dates.week_begin())
print_variables(df)

Equivalent SQL: select accounts AS accounts, "Feb" AS "Feb", "Jan" AS "Jan", "Mar" AS "Mar", "Apr" AS "Apr", datetime AS datetime, dates AS dates, td_week_begin(dates, 'Teradata', NULL) AS res from (select accounts AS accounts, "Feb" AS "Feb", "Jan" AS "Jan", "Mar" AS "Mar", "Apr" AS "Apr", datetime AS datetime, CASE WHEN (accounts = 'Alpha Co') THEN datetime + 191 WHEN (accounts = 'Blue Inc') THEN datetime + 56 WHEN (accounts = 'Jones LLC') THEN datetime + 440 WHEN (accounts = 'Orange Inc') THEN datetime + 395 WHEN (accounts = 'Yellow Inc') THEN datetime + 362 WHEN (accounts = 'Red Inc') THEN datetime + 233 END AS dates from "sales") as temp_table


 ************************* DataFrame *********************

              Feb    Jan    Mar    Apr    datetime     dates       res
accounts
Blue Inc     90.0   50.0   95.0  101.0  04/01/2017  17/03/01  17/02/26
Red Inc     200.0  150.0  140.0    NaN  04/01/2017  17/08/25  17/08/20
Yellow Inc   90.0    NaN    NaN    NaN  04/01/2017  18/01/01  18/01/01
Jones LLC   200.0  150.0  140.0  180.0  04/01/2017  18/03/20  18/03/18
Orange Inc  210.0    NaN    NaN  250.0  04/01/2017  18/02/03  18/01/28
Alpha Co    210.0  200.0  215.0  250.0  04/01/2017  17/07/14  17/07/09

 ************************* DataFrame.dtypes *********************

accounts              str
Feb                 float
Jan                   int
Mar                   int
Apr                   int
datetime    datetime.date
dates       datetime.date
res         datetime.date

### DataFrameColumn.week_end()

In [6]:
# Returns the last date or timestamp of the week that ends immediately after the specified date or timestamp value in a column as a literal.
df = df_sales.assign(res = df_sales.dates.week_end())
print_variables(df)

Equivalent SQL: select accounts AS accounts, "Feb" AS "Feb", "Jan" AS "Jan", "Mar" AS "Mar", "Apr" AS "Apr", datetime AS datetime, dates AS dates, td_week_end(dates, 'Teradata', NULL) AS res from (select accounts AS accounts, "Feb" AS "Feb", "Jan" AS "Jan", "Mar" AS "Mar", "Apr" AS "Apr", datetime AS datetime, CASE WHEN (accounts = 'Alpha Co') THEN datetime + 191 WHEN (accounts = 'Blue Inc') THEN datetime + 56 WHEN (accounts = 'Jones LLC') THEN datetime + 440 WHEN (accounts = 'Orange Inc') THEN datetime + 395 WHEN (accounts = 'Yellow Inc') THEN datetime + 362 WHEN (accounts = 'Red Inc') THEN datetime + 233 END AS dates from "sales") as temp_table


 ************************* DataFrame *********************

              Feb    Jan    Mar    Apr    datetime     dates       res
accounts
Blue Inc     90.0   50.0   95.0  101.0  04/01/2017  17/03/01  17/03/04
Red Inc     200.0  150.0  140.0    NaN  04/01/2017  17/08/25  17/08/26
Yellow Inc   90.0    NaN    NaN    NaN  04/01/2017  18/01/01  18/01/06
Jones LLC   200.0  150.0  140.0  180.0  04/01/2017  18/03/20  18/03/24
Orange Inc  210.0    NaN    NaN  250.0  04/01/2017  18/02/03  18/02/03
Alpha Co    210.0  200.0  215.0  250.0  04/01/2017  17/07/14  17/07/15

 ************************* DataFrame.dtypes *********************

accounts              str
Feb                 float
Jan                   int
Mar                   int
Apr                   int
datetime    datetime.date
dates       datetime.date
res         datetime.date

### DataFrameColumn.month_begin()

In [7]:
# Returns the first date or timestamp of the month that begins immediately before the specified date or timestamp value in a column or as a literal.
df = df_sales.assign(res = df_sales.dates.month_begin())
print_variables(df)

Equivalent SQL: select accounts AS accounts, "Feb" AS "Feb", "Jan" AS "Jan", "Mar" AS "Mar", "Apr" AS "Apr", datetime AS datetime, dates AS dates, td_month_begin(dates, 'Teradata', NULL) AS res from (select accounts AS accounts, "Feb" AS "Feb", "Jan" AS "Jan", "Mar" AS "Mar", "Apr" AS "Apr", datetime AS datetime, CASE WHEN (accounts = 'Alpha Co') THEN datetime + 191 WHEN (accounts = 'Blue Inc') THEN datetime + 56 WHEN (accounts = 'Jones LLC') THEN datetime + 440 WHEN (accounts = 'Orange Inc') THEN datetime + 395 WHEN (accounts = 'Yellow Inc') THEN datetime + 362 WHEN (accounts = 'Red Inc') THEN datetime + 233 END AS dates from "sales") as temp_table


 ************************* DataFrame *********************

              Feb    Jan    Mar    Apr    datetime     dates       res
accounts
Blue Inc     90.0   50.0   95.0  101.0  04/01/2017  17/03/01  17/03/01
Red Inc     200.0  150.0  140.0    NaN  04/01/2017  17/08/25  17/08/01
Yellow Inc   90.0    NaN    NaN    NaN  04/01/2017  18/01/01  18/01/01
Jones LLC   200.0  150.0  140.0  180.0  04/01/2017  18/03/20  18/03/01
Orange Inc  210.0    NaN    NaN  250.0  04/01/2017  18/02/03  18/02/01
Alpha Co    210.0  200.0  215.0  250.0  04/01/2017  17/07/14  17/07/01

 ************************* DataFrame.dtypes *********************

accounts              str
Feb                 float
Jan                   int
Mar                   int
Apr                   int
datetime    datetime.date
dates       datetime.date
res         datetime.date

### DataFrameColumn.month_end()

In [8]:
# Returns the last date or timestamp of the month that ends immediately after the specified date or timestamp value in a column or as a literal.
df = df_sales.assign(res = df_sales.dates.month_end())
print_variables(df)

Equivalent SQL: select accounts AS accounts, "Feb" AS "Feb", "Jan" AS "Jan", "Mar" AS "Mar", "Apr" AS "Apr", datetime AS datetime, dates AS dates, td_month_end(dates, 'Teradata', NULL) AS res from (select accounts AS accounts, "Feb" AS "Feb", "Jan" AS "Jan", "Mar" AS "Mar", "Apr" AS "Apr", datetime AS datetime, CASE WHEN (accounts = 'Alpha Co') THEN datetime + 191 WHEN (accounts = 'Blue Inc') THEN datetime + 56 WHEN (accounts = 'Jones LLC') THEN datetime + 440 WHEN (accounts = 'Orange Inc') THEN datetime + 395 WHEN (accounts = 'Yellow Inc') THEN datetime + 362 WHEN (accounts = 'Red Inc') THEN datetime + 233 END AS dates from "sales") as temp_table


 ************************* DataFrame *********************

              Feb    Jan    Mar    Apr    datetime     dates       res
accounts
Blue Inc     90.0   50.0   95.0  101.0  04/01/2017  17/03/01  17/03/31
Red Inc     200.0  150.0  140.0    NaN  04/01/2017  17/08/25  17/08/31
Yellow Inc   90.0    NaN    NaN    NaN  04/01/2017  18/01/01  18/01/31
Jones LLC   200.0  150.0  140.0  180.0  04/01/2017  18/03/20  18/03/31
Orange Inc  210.0    NaN    NaN  250.0  04/01/2017  18/02/03  18/02/28
Alpha Co    210.0  200.0  215.0  250.0  04/01/2017  17/07/14  17/07/31

 ************************* DataFrame.dtypes *********************

accounts              str
Feb                 float
Jan                   int
Mar                   int
Apr                   int
datetime    datetime.date
dates       datetime.date
res         datetime.date

### DataFrameColumn.year_begin()

In [9]:
# Returns the first date or timestamp of the year that begins immediately before the specified date or timestamp value in a column or as a literal.
df = df_sales.assign(res = df_sales.dates.year_begin())
print_variables(df)

Equivalent SQL: select accounts AS accounts, "Feb" AS "Feb", "Jan" AS "Jan", "Mar" AS "Mar", "Apr" AS "Apr", datetime AS datetime, dates AS dates, td_year_begin(dates, 'Teradata', NULL) AS res from (select accounts AS accounts, "Feb" AS "Feb", "Jan" AS "Jan", "Mar" AS "Mar", "Apr" AS "Apr", datetime AS datetime, CASE WHEN (accounts = 'Alpha Co') THEN datetime + 191 WHEN (accounts = 'Blue Inc') THEN datetime + 56 WHEN (accounts = 'Jones LLC') THEN datetime + 440 WHEN (accounts = 'Orange Inc') THEN datetime + 395 WHEN (accounts = 'Yellow Inc') THEN datetime + 362 WHEN (accounts = 'Red Inc') THEN datetime + 233 END AS dates from "sales") as temp_table


 ************************* DataFrame *********************

              Feb    Jan    Mar    Apr    datetime     dates       res
accounts
Blue Inc     90.0   50.0   95.0  101.0  04/01/2017  17/03/01  17/01/01
Red Inc     200.0  150.0  140.0    NaN  04/01/2017  17/08/25  17/01/01
Yellow Inc   90.0    NaN    NaN    NaN  04/01/2017  18/01/01  18/01/01
Jones LLC   200.0  150.0  140.0  180.0  04/01/2017  18/03/20  18/01/01
Orange Inc  210.0    NaN    NaN  250.0  04/01/2017  18/02/03  18/01/01
Alpha Co    210.0  200.0  215.0  250.0  04/01/2017  17/07/14  17/01/01

 ************************* DataFrame.dtypes *********************

accounts              str
Feb                 float
Jan                   int
Mar                   int
Apr                   int
datetime    datetime.date
dates       datetime.date
res         datetime.date

### DataFrameColumn.year_end()

In [10]:
# Returns the last date or timestamp of the year that ends immediately after the specified date or timestamp value in a column or as a literal.
df = df_sales.assign(res = df_sales.dates.year_end())
print_variables(df)

Equivalent SQL: select accounts AS accounts, "Feb" AS "Feb", "Jan" AS "Jan", "Mar" AS "Mar", "Apr" AS "Apr", datetime AS datetime, dates AS dates, td_year_end(dates, 'Teradata', NULL) AS res from (select accounts AS accounts, "Feb" AS "Feb", "Jan" AS "Jan", "Mar" AS "Mar", "Apr" AS "Apr", datetime AS datetime, CASE WHEN (accounts = 'Alpha Co') THEN datetime + 191 WHEN (accounts = 'Blue Inc') THEN datetime + 56 WHEN (accounts = 'Jones LLC') THEN datetime + 440 WHEN (accounts = 'Orange Inc') THEN datetime + 395 WHEN (accounts = 'Yellow Inc') THEN datetime + 362 WHEN (accounts = 'Red Inc') THEN datetime + 233 END AS dates from "sales") as temp_table


 ************************* DataFrame *********************

              Feb    Jan    Mar    Apr    datetime     dates       res
accounts
Alpha Co    210.0  200.0  215.0  250.0  04/01/2017  17/07/14  17/12/31
Blue Inc     90.0   50.0   95.0  101.0  04/01/2017  17/03/01  17/12/31
Jones LLC   200.0  150.0  140.0  180.0  04/01/2017  18/03/20  18/12/31
Orange Inc  210.0    NaN    NaN  250.0  04/01/2017  18/02/03  18/12/31
Yellow Inc   90.0    NaN    NaN    NaN  04/01/2017  18/01/01  18/12/31
Red Inc     200.0  150.0  140.0    NaN  04/01/2017  17/08/25  17/12/31

 ************************* DataFrame.dtypes *********************

accounts              str
Feb                 float
Jan                   int
Mar                   int
Apr                   int
datetime    datetime.date
dates       datetime.date
res         datetime.date

### DataFrameColumn.quarter_begin()

In [11]:
# Returns the first date or timestamp of the quarter that begins immediately before the specified date or timestamp value in a column as a literal.

df = df_sales.assign(res = df_sales.dates.quarter_begin())
print_variables(df)

Equivalent SQL: select accounts AS accounts, "Feb" AS "Feb", "Jan" AS "Jan", "Mar" AS "Mar", "Apr" AS "Apr", datetime AS datetime, dates AS dates, td_quarter_begin(dates, 'Teradata', NULL) AS res from (select accounts AS accounts, "Feb" AS "Feb", "Jan" AS "Jan", "Mar" AS "Mar", "Apr" AS "Apr", datetime AS datetime, CASE WHEN (accounts = 'Alpha Co') THEN datetime + 191 WHEN (accounts = 'Blue Inc') THEN datetime + 56 WHEN (accounts = 'Jones LLC') THEN datetime + 440 WHEN (accounts = 'Orange Inc') THEN datetime + 395 WHEN (accounts = 'Yellow Inc') THEN datetime + 362 WHEN (accounts = 'Red Inc') THEN datetime + 233 END AS dates from "sales") as temp_table


 ************************* DataFrame *********************

              Feb    Jan    Mar    Apr    datetime     dates       res
accounts
Blue Inc     90.0   50.0   95.0  101.0  04/01/2017  17/03/01  17/01/01
Red Inc     200.0  150.0  140.0    NaN  04/01/2017  17/08/25  17/07/01
Yellow Inc   90.0    NaN    NaN    NaN  04/01/2017  18/01/01  18/01/01
Jones LLC   200.0  150.0  140.0  180.0  04/01/2017  18/03/20  18/01/01
Orange Inc  210.0    NaN    NaN  250.0  04/01/2017  18/02/03  18/01/01
Alpha Co    210.0  200.0  215.0  250.0  04/01/2017  17/07/14  17/07/01

 ************************* DataFrame.dtypes *********************

accounts              str
Feb                 float
Jan                   int
Mar                   int
Apr                   int
datetime    datetime.date
dates       datetime.date
res         datetime.date

### DataFrameColumn.quarter_end()

In [12]:
# Returns the last date or timestamp of the quarter that ends immediately after the specified date or timestamp value in a column as a literal.

df = df_sales.assign(res = df_sales.dates.quarter_end())
print_variables(df)

Equivalent SQL: select accounts AS accounts, "Feb" AS "Feb", "Jan" AS "Jan", "Mar" AS "Mar", "Apr" AS "Apr", datetime AS datetime, dates AS dates, td_quarter_end(dates, 'Teradata', NULL) AS res from (select accounts AS accounts, "Feb" AS "Feb", "Jan" AS "Jan", "Mar" AS "Mar", "Apr" AS "Apr", datetime AS datetime, CASE WHEN (accounts = 'Alpha Co') THEN datetime + 191 WHEN (accounts = 'Blue Inc') THEN datetime + 56 WHEN (accounts = 'Jones LLC') THEN datetime + 440 WHEN (accounts = 'Orange Inc') THEN datetime + 395 WHEN (accounts = 'Yellow Inc') THEN datetime + 362 WHEN (accounts = 'Red Inc') THEN datetime + 233 END AS dates from "sales") as temp_table


 ************************* DataFrame *********************

              Feb    Jan    Mar    Apr    datetime     dates       res
accounts
Blue Inc     90.0   50.0   95.0  101.0  04/01/2017  17/03/01  17/03/31
Red Inc     200.0  150.0  140.0    NaN  04/01/2017  17/08/25  17/09/30
Yellow Inc   90.0    NaN    NaN    NaN  04/01/2017  18/01/01  18/03/31
Jones LLC   200.0  150.0  140.0  180.0  04/01/2017  18/03/20  18/03/31
Orange Inc  210.0    NaN    NaN  250.0  04/01/2017  18/02/03  18/03/31
Alpha Co    210.0  200.0  215.0  250.0  04/01/2017  17/07/14  17/09/30

 ************************* DataFrame.dtypes *********************

accounts              str
Feb                 float
Jan                   int
Mar                   int
Apr                   int
datetime    datetime.date
dates       datetime.date
res         datetime.date

### DataFrameColumn.last_sunday()

In [13]:
# Returns the date or timestamp of Sunday that falls immediately before the specified date or timestamp value in a column as a literal.
df = df_sales.assign(res = df_sales.dates.last_sunday())
print_variables(df)

Equivalent SQL: select accounts AS accounts, "Feb" AS "Feb", "Jan" AS "Jan", "Mar" AS "Mar", "Apr" AS "Apr", datetime AS datetime, dates AS dates, td_sunday(dates, 'Teradata', NULL) AS res from (select accounts AS accounts, "Feb" AS "Feb", "Jan" AS "Jan", "Mar" AS "Mar", "Apr" AS "Apr", datetime AS datetime, CASE WHEN (accounts = 'Alpha Co') THEN datetime + 191 WHEN (accounts = 'Blue Inc') THEN datetime + 56 WHEN (accounts = 'Jones LLC') THEN datetime + 440 WHEN (accounts = 'Orange Inc') THEN datetime + 395 WHEN (accounts = 'Yellow Inc') THEN datetime + 362 WHEN (accounts = 'Red Inc') THEN datetime + 233 END AS dates from "sales") as temp_table


 ************************* DataFrame *********************

              Feb    Jan    Mar    Apr    datetime     dates       res
accounts
Blue Inc     90.0   50.0   95.0  101.0  04/01/2017  17/03/01  17/02/26
Red Inc     200.0  150.0  140.0    NaN  04/01/2017  17/08/25  17/08/20
Yellow Inc   90.0    NaN    NaN    NaN  04/01/2017  18/01/01  17/12/31
Jones LLC   200.0  150.0  140.0  180.0  04/01/2017  18/03/20  18/03/18
Orange Inc  210.0    NaN    NaN  250.0  04/01/2017  18/02/03  18/01/28
Alpha Co    210.0  200.0  215.0  250.0  04/01/2017  17/07/14  17/07/09

 ************************* DataFrame.dtypes *********************

accounts              str
Feb                 float
Jan                   int
Mar                   int
Apr                   int
datetime    datetime.date
dates       datetime.date
res         datetime.date

### DataFrameColumn.last_monday()

In [14]:
# Returns the date or timestamp of Monday that falls immediately before the specified date or timestamp value in a column as a literal.
df = df_sales.assign(res = df_sales.dates.last_monday())
print_variables(df)

Equivalent SQL: select accounts AS accounts, "Feb" AS "Feb", "Jan" AS "Jan", "Mar" AS "Mar", "Apr" AS "Apr", datetime AS datetime, dates AS dates, td_monday(dates, 'Teradata', NULL) AS res from (select accounts AS accounts, "Feb" AS "Feb", "Jan" AS "Jan", "Mar" AS "Mar", "Apr" AS "Apr", datetime AS datetime, CASE WHEN (accounts = 'Alpha Co') THEN datetime + 191 WHEN (accounts = 'Blue Inc') THEN datetime + 56 WHEN (accounts = 'Jones LLC') THEN datetime + 440 WHEN (accounts = 'Orange Inc') THEN datetime + 395 WHEN (accounts = 'Yellow Inc') THEN datetime + 362 WHEN (accounts = 'Red Inc') THEN datetime + 233 END AS dates from "sales") as temp_table


 ************************* DataFrame *********************

              Feb    Jan    Mar    Apr    datetime     dates       res
accounts
Blue Inc     90.0   50.0   95.0  101.0  04/01/2017  17/03/01  17/02/27
Red Inc     200.0  150.0  140.0    NaN  04/01/2017  17/08/25  17/08/21
Yellow Inc   90.0    NaN    NaN    NaN  04/01/2017  18/01/01  18/01/01
Jones LLC   200.0  150.0  140.0  180.0  04/01/2017  18/03/20  18/03/19
Orange Inc  210.0    NaN    NaN  250.0  04/01/2017  18/02/03  18/01/29
Alpha Co    210.0  200.0  215.0  250.0  04/01/2017  17/07/14  17/07/10

 ************************* DataFrame.dtypes *********************

accounts              str
Feb                 float
Jan                   int
Mar                   int
Apr                   int
datetime    datetime.date
dates       datetime.date
res         datetime.date

### DataFrameColumn.last_tuesday()

In [15]:
# Returns the date or timestamp of Tuesday that falls immediately before the specified date or timestamp value in a column as a literal.
df = df_sales.assign(res = df_sales.dates.last_tuesday())
print_variables(df)

Equivalent SQL: select accounts AS accounts, "Feb" AS "Feb", "Jan" AS "Jan", "Mar" AS "Mar", "Apr" AS "Apr", datetime AS datetime, dates AS dates, td_tuesday(dates, 'Teradata', NULL) AS res from (select accounts AS accounts, "Feb" AS "Feb", "Jan" AS "Jan", "Mar" AS "Mar", "Apr" AS "Apr", datetime AS datetime, CASE WHEN (accounts = 'Alpha Co') THEN datetime + 191 WHEN (accounts = 'Blue Inc') THEN datetime + 56 WHEN (accounts = 'Jones LLC') THEN datetime + 440 WHEN (accounts = 'Orange Inc') THEN datetime + 395 WHEN (accounts = 'Yellow Inc') THEN datetime + 362 WHEN (accounts = 'Red Inc') THEN datetime + 233 END AS dates from "sales") as temp_table


 ************************* DataFrame *********************

              Feb    Jan    Mar    Apr    datetime     dates       res
accounts
Blue Inc     90.0   50.0   95.0  101.0  04/01/2017  17/03/01  17/02/28
Red Inc     200.0  150.0  140.0    NaN  04/01/2017  17/08/25  17/08/22
Yellow Inc   90.0    NaN    NaN    NaN  04/01/2017  18/01/01  17/12/26
Jones LLC   200.0  150.0  140.0  180.0  04/01/2017  18/03/20  18/03/20
Orange Inc  210.0    NaN    NaN  250.0  04/01/2017  18/02/03  18/01/30
Alpha Co    210.0  200.0  215.0  250.0  04/01/2017  17/07/14  17/07/11

 ************************* DataFrame.dtypes *********************

accounts              str
Feb                 float
Jan                   int
Mar                   int
Apr                   int
datetime    datetime.date
dates       datetime.date
res         datetime.date

### DataFrameColumn.last_wednesday()

In [16]:
# Returns the date or timestamp of Wednesday that falls immediately before the specified date or timestamp value in a column as a literal.
df = df_sales.assign(res = df_sales.dates.last_wednesday())
print_variables(df)

Equivalent SQL: select accounts AS accounts, "Feb" AS "Feb", "Jan" AS "Jan", "Mar" AS "Mar", "Apr" AS "Apr", datetime AS datetime, dates AS dates, td_wednesday(dates, 'Teradata', NULL) AS res from (select accounts AS accounts, "Feb" AS "Feb", "Jan" AS "Jan", "Mar" AS "Mar", "Apr" AS "Apr", datetime AS datetime, CASE WHEN (accounts = 'Alpha Co') THEN datetime + 191 WHEN (accounts = 'Blue Inc') THEN datetime + 56 WHEN (accounts = 'Jones LLC') THEN datetime + 440 WHEN (accounts = 'Orange Inc') THEN datetime + 395 WHEN (accounts = 'Yellow Inc') THEN datetime + 362 WHEN (accounts = 'Red Inc') THEN datetime + 233 END AS dates from "sales") as temp_table


 ************************* DataFrame *********************

              Feb    Jan    Mar    Apr    datetime     dates       res
accounts
Alpha Co    210.0  200.0  215.0  250.0  04/01/2017  17/07/14  17/07/12
Blue Inc     90.0   50.0   95.0  101.0  04/01/2017  17/03/01  17/03/01
Jones LLC   200.0  150.0  140.0  180.0  04/01/2017  18/03/20  18/03/14
Orange Inc  210.0    NaN    NaN  250.0  04/01/2017  18/02/03  18/01/31
Yellow Inc   90.0    NaN    NaN    NaN  04/01/2017  18/01/01  17/12/27
Red Inc     200.0  150.0  140.0    NaN  04/01/2017  17/08/25  17/08/23

 ************************* DataFrame.dtypes *********************

accounts              str
Feb                 float
Jan                   int
Mar                   int
Apr                   int
datetime    datetime.date
dates       datetime.date
res         datetime.date

### DataFrameColumn.last_thursday()

In [17]:
# Returns the date or timestamp of Thursday that falls immediately before the specified date or timestamp value in a column as a literal.
df = df_sales.assign(res = df_sales.dates.last_thursday())
print_variables(df)

Equivalent SQL: select accounts AS accounts, "Feb" AS "Feb", "Jan" AS "Jan", "Mar" AS "Mar", "Apr" AS "Apr", datetime AS datetime, dates AS dates, td_thursday(dates, 'Teradata', NULL) AS res from (select accounts AS accounts, "Feb" AS "Feb", "Jan" AS "Jan", "Mar" AS "Mar", "Apr" AS "Apr", datetime AS datetime, CASE WHEN (accounts = 'Alpha Co') THEN datetime + 191 WHEN (accounts = 'Blue Inc') THEN datetime + 56 WHEN (accounts = 'Jones LLC') THEN datetime + 440 WHEN (accounts = 'Orange Inc') THEN datetime + 395 WHEN (accounts = 'Yellow Inc') THEN datetime + 362 WHEN (accounts = 'Red Inc') THEN datetime + 233 END AS dates from "sales") as temp_table


 ************************* DataFrame *********************

              Feb    Jan    Mar    Apr    datetime     dates       res
accounts
Alpha Co    210.0  200.0  215.0  250.0  04/01/2017  17/07/14  17/07/13
Blue Inc     90.0   50.0   95.0  101.0  04/01/2017  17/03/01  17/02/23
Jones LLC   200.0  150.0  140.0  180.0  04/01/2017  18/03/20  18/03/15
Orange Inc  210.0    NaN    NaN  250.0  04/01/2017  18/02/03  18/02/01
Yellow Inc   90.0    NaN    NaN    NaN  04/01/2017  18/01/01  17/12/28
Red Inc     200.0  150.0  140.0    NaN  04/01/2017  17/08/25  17/08/24

 ************************* DataFrame.dtypes *********************

accounts              str
Feb                 float
Jan                   int
Mar                   int
Apr                   int
datetime    datetime.date
dates       datetime.date
res         datetime.date

### DataFrameColumn.last_friday()

In [18]:
# Returns the date or timestamp of Friday that falls immediately before the specified date or timestamp value in a column as a literal.
df = df_sales.assign(res = df_sales.dates.last_friday())
print_variables(df)

Equivalent SQL: select accounts AS accounts, "Feb" AS "Feb", "Jan" AS "Jan", "Mar" AS "Mar", "Apr" AS "Apr", datetime AS datetime, dates AS dates, td_friday(dates, 'Teradata', NULL) AS res from (select accounts AS accounts, "Feb" AS "Feb", "Jan" AS "Jan", "Mar" AS "Mar", "Apr" AS "Apr", datetime AS datetime, CASE WHEN (accounts = 'Alpha Co') THEN datetime + 191 WHEN (accounts = 'Blue Inc') THEN datetime + 56 WHEN (accounts = 'Jones LLC') THEN datetime + 440 WHEN (accounts = 'Orange Inc') THEN datetime + 395 WHEN (accounts = 'Yellow Inc') THEN datetime + 362 WHEN (accounts = 'Red Inc') THEN datetime + 233 END AS dates from "sales") as temp_table


 ************************* DataFrame *********************

              Feb    Jan    Mar    Apr    datetime     dates       res
accounts
Alpha Co    210.0  200.0  215.0  250.0  04/01/2017  17/07/14  17/07/14
Blue Inc     90.0   50.0   95.0  101.0  04/01/2017  17/03/01  17/02/24
Jones LLC   200.0  150.0  140.0  180.0  04/01/2017  18/03/20  18/03/16
Orange Inc  210.0    NaN    NaN  250.0  04/01/2017  18/02/03  18/02/02
Yellow Inc   90.0    NaN    NaN    NaN  04/01/2017  18/01/01  17/12/29
Red Inc     200.0  150.0  140.0    NaN  04/01/2017  17/08/25  17/08/25

 ************************* DataFrame.dtypes *********************

accounts              str
Feb                 float
Jan                   int
Mar                   int
Apr                   int
datetime    datetime.date
dates       datetime.date
res         datetime.date

### DataFrameColumn.last_saturday()

In [19]:
# Returns the Saturday that falls immediately before the value in column.
df = df_sales.assign(res = df_sales.dates.last_saturday())
print_variables(df)

Equivalent SQL: select accounts AS accounts, "Feb" AS "Feb", "Jan" AS "Jan", "Mar" AS "Mar", "Apr" AS "Apr", datetime AS datetime, dates AS dates, td_saturday(dates, 'Teradata', NULL) AS res from (select accounts AS accounts, "Feb" AS "Feb", "Jan" AS "Jan", "Mar" AS "Mar", "Apr" AS "Apr", datetime AS datetime, CASE WHEN (accounts = 'Alpha Co') THEN datetime + 191 WHEN (accounts = 'Blue Inc') THEN datetime + 56 WHEN (accounts = 'Jones LLC') THEN datetime + 440 WHEN (accounts = 'Orange Inc') THEN datetime + 395 WHEN (accounts = 'Yellow Inc') THEN datetime + 362 WHEN (accounts = 'Red Inc') THEN datetime + 233 END AS dates from "sales") as temp_table


 ************************* DataFrame *********************

              Feb    Jan    Mar    Apr    datetime     dates       res
accounts
Blue Inc     90.0   50.0   95.0  101.0  04/01/2017  17/03/01  17/02/25
Red Inc     200.0  150.0  140.0    NaN  04/01/2017  17/08/25  17/08/19
Yellow Inc   90.0    NaN    NaN    NaN  04/01/2017  18/01/01  17/12/30
Jones LLC   200.0  150.0  140.0  180.0  04/01/2017  18/03/20  18/03/17
Orange Inc  210.0    NaN    NaN  250.0  04/01/2017  18/02/03  18/02/03
Alpha Co    210.0  200.0  215.0  250.0  04/01/2017  17/07/14  17/07/08

 ************************* DataFrame.dtypes *********************

accounts              str
Feb                 float
Jan                   int
Mar                   int
Apr                   int
datetime    datetime.date
dates       datetime.date
res         datetime.date

### DataFrameColumn.day_of_week()

In [20]:
# Returns the number of days from the beginning of the week to the specified date or timestamp value in a column as a literal.
df = df_sales.assign(res = df_sales.dates.day_of_week())
print_variables(df)

Equivalent SQL: select accounts AS accounts, "Feb" AS "Feb", "Jan" AS "Jan", "Mar" AS "Mar", "Apr" AS "Apr", datetime AS datetime, dates AS dates, DayNumber_Of_Week(dates, 'Teradata') AS res from (select accounts AS accounts, "Feb" AS "Feb", "Jan" AS "Jan", "Mar" AS "Mar", "Apr" AS "Apr", datetime AS datetime, CASE WHEN (accounts = 'Alpha Co') THEN datetime + 191 WHEN (accounts = 'Blue Inc') THEN datetime + 56 WHEN (accounts = 'Jones LLC') THEN datetime + 440 WHEN (accounts = 'Orange Inc') THEN datetime + 395 WHEN (accounts = 'Yellow Inc') THEN datetime + 362 WHEN (accounts = 'Red Inc') THEN datetime + 233 END AS dates from "sales") as temp_table


 ************************* DataFrame *********************

              Feb    Jan    Mar    Apr    datetime     dates  res
accounts
Blue Inc     90.0   50.0   95.0  101.0  04/01/2017  17/03/01    4
Red Inc     200.0  150.0  140.0    NaN  04/01/2017  17/08/25    6
Yellow Inc   90.0    NaN    NaN    NaN  04/01/2017  18/01/01    2
Jones LLC   200.0  150.0  140.0  180.0  04/01/2017  18/03/20    3
Orange Inc  210.0    NaN    NaN  250.0  04/01/2017  18/02/03    7
Alpha Co    210.0  200.0  215.0  250.0  04/01/2017  17/07/14    6

 ************************* DataFrame.dtypes *********************

accounts              str
Feb                 float
Jan                   int
Mar                   int
Apr                   int
datetime    datetime.date
dates       datetime.date
res                   int

### DataFrameColumn.day_of_month()

In [21]:
# Returns the number of days from the beginning of the month to the specified date or timestamp value in a column as a literal.

df = df_sales.assign(res = df_sales.dates.day_of_month())
print_variables(df)

Equivalent SQL: select accounts AS accounts, "Feb" AS "Feb", "Jan" AS "Jan", "Mar" AS "Mar", "Apr" AS "Apr", datetime AS datetime, dates AS dates, DayNumber_Of_Month(dates, 'Teradata') AS res from (select accounts AS accounts, "Feb" AS "Feb", "Jan" AS "Jan", "Mar" AS "Mar", "Apr" AS "Apr", datetime AS datetime, CASE WHEN (accounts = 'Alpha Co') THEN datetime + 191 WHEN (accounts = 'Blue Inc') THEN datetime + 56 WHEN (accounts = 'Jones LLC') THEN datetime + 440 WHEN (accounts = 'Orange Inc') THEN datetime + 395 WHEN (accounts = 'Yellow Inc') THEN datetime + 362 WHEN (accounts = 'Red Inc') THEN datetime + 233 END AS dates from "sales") as temp_table


 ************************* DataFrame *********************

              Feb    Jan    Mar    Apr    datetime     dates  res
accounts
Alpha Co    210.0  200.0  215.0  250.0  04/01/2017  17/07/14   14
Blue Inc     90.0   50.0   95.0  101.0  04/01/2017  17/03/01    1
Jones LLC   200.0  150.0  140.0  180.0  04/01/2017  18/03/20   20
Orange Inc  210.0    NaN    NaN  250.0  04/01/2017  18/02/03    3
Yellow Inc   90.0    NaN    NaN    NaN  04/01/2017  18/01/01    1
Red Inc     200.0  150.0  140.0    NaN  04/01/2017  17/08/25   25

 ************************* DataFrame.dtypes *********************

accounts              str
Feb                 float
Jan                   int
Mar                   int
Apr                   int
datetime    datetime.date
dates       datetime.date
res                   int

### DataFrameColumn.week_of_month()

In [22]:
# Returns the number of weeks from the beginning of the month to the date value in column.

df = df_sales.assign(res = df_sales.dates.week_of_month())
print_variables(df)

Equivalent SQL: select accounts AS accounts, "Feb" AS "Feb", "Jan" AS "Jan", "Mar" AS "Mar", "Apr" AS "Apr", datetime AS datetime, dates AS dates, WeekNumber_Of_Month(dates, 'Teradata') AS res from (select accounts AS accounts, "Feb" AS "Feb", "Jan" AS "Jan", "Mar" AS "Mar", "Apr" AS "Apr", datetime AS datetime, CASE WHEN (accounts = 'Alpha Co') THEN datetime + 191 WHEN (accounts = 'Blue Inc') THEN datetime + 56 WHEN (accounts = 'Jones LLC') THEN datetime + 440 WHEN (accounts = 'Orange Inc') THEN datetime + 395 WHEN (accounts = 'Yellow Inc') THEN datetime + 362 WHEN (accounts = 'Red Inc') THEN datetime + 233 END AS dates from "sales") as temp_table


 ************************* DataFrame *********************

              Feb    Jan    Mar    Apr    datetime     dates  res
accounts
Blue Inc     90.0   50.0   95.0  101.0  04/01/2017  17/03/01    0
Red Inc     200.0  150.0  140.0    NaN  04/01/2017  17/08/25    3
Yellow Inc   90.0    NaN    NaN    NaN  04/01/2017  18/01/01    0
Jones LLC   200.0  150.0  140.0  180.0  04/01/2017  18/03/20    3
Orange Inc  210.0    NaN    NaN  250.0  04/01/2017  18/02/03    0
Alpha Co    210.0  200.0  215.0  250.0  04/01/2017  17/07/14    2

 ************************* DataFrame.dtypes *********************

accounts              str
Feb                 float
Jan                   int
Mar                   int
Apr                   int
datetime    datetime.date
dates       datetime.date
res                   int

### DataFrameColumn.day_occurrence_of_month()

In [23]:
# Returns the nth occurrence of the weekday in the month for the date value in column.

df = df_sales.assign(res = df_sales.dates.day_occurrence_of_month())
print_variables(df)

Equivalent SQL: select accounts AS accounts, "Feb" AS "Feb", "Jan" AS "Jan", "Mar" AS "Mar", "Apr" AS "Apr", datetime AS datetime, dates AS dates, DayOccurrence_Of_Month(dates, 'Teradata') AS res from (select accounts AS accounts, "Feb" AS "Feb", "Jan" AS "Jan", "Mar" AS "Mar", "Apr" AS "Apr", datetime AS datetime, CASE WHEN (accounts = 'Alpha Co') THEN datetime + 191 WHEN (accounts = 'Blue Inc') THEN datetime + 56 WHEN (accounts = 'Jones LLC') THEN datetime + 440 WHEN (accounts = 'Orange Inc') THEN datetime + 395 WHEN (accounts = 'Yellow Inc') THEN datetime + 362 WHEN (accounts = 'Red Inc') THEN datetime + 233 END AS dates from "sales") as temp_table


 ************************* DataFrame *********************

              Feb    Jan    Mar    Apr    datetime     dates  res
accounts
Blue Inc     90.0   50.0   95.0  101.0  04/01/2017  17/03/01    1
Red Inc     200.0  150.0  140.0    NaN  04/01/2017  17/08/25    4
Yellow Inc   90.0    NaN    NaN    NaN  04/01/2017  18/01/01    1
Jones LLC   200.0  150.0  140.0  180.0  04/01/2017  18/03/20    3
Orange Inc  210.0    NaN    NaN  250.0  04/01/2017  18/02/03    1
Alpha Co    210.0  200.0  215.0  250.0  04/01/2017  17/07/14    2

 ************************* DataFrame.dtypes *********************

accounts              str
Feb                 float
Jan                   int
Mar                   int
Apr                   int
datetime    datetime.date
dates       datetime.date
res                   int

### DataFrameColumn.day_of_year()

In [24]:
# Returns the number of days from the beginning of the year to the specified date or timestamp value in a column as a literal.

df = df_sales.assign(res = df_sales.dates.day_of_year())
print_variables(df)

Equivalent SQL: select accounts AS accounts, "Feb" AS "Feb", "Jan" AS "Jan", "Mar" AS "Mar", "Apr" AS "Apr", datetime AS datetime, dates AS dates, DayNumber_Of_Year(dates, 'Teradata') AS res from (select accounts AS accounts, "Feb" AS "Feb", "Jan" AS "Jan", "Mar" AS "Mar", "Apr" AS "Apr", datetime AS datetime, CASE WHEN (accounts = 'Alpha Co') THEN datetime + 191 WHEN (accounts = 'Blue Inc') THEN datetime + 56 WHEN (accounts = 'Jones LLC') THEN datetime + 440 WHEN (accounts = 'Orange Inc') THEN datetime + 395 WHEN (accounts = 'Yellow Inc') THEN datetime + 362 WHEN (accounts = 'Red Inc') THEN datetime + 233 END AS dates from "sales") as temp_table


 ************************* DataFrame *********************

              Feb    Jan    Mar    Apr    datetime     dates  res
accounts
Blue Inc     90.0   50.0   95.0  101.0  04/01/2017  17/03/01   60
Red Inc     200.0  150.0  140.0    NaN  04/01/2017  17/08/25  237
Yellow Inc   90.0    NaN    NaN    NaN  04/01/2017  18/01/01    1
Jones LLC   200.0  150.0  140.0  180.0  04/01/2017  18/03/20   79
Orange Inc  210.0    NaN    NaN  250.0  04/01/2017  18/02/03   34
Alpha Co    210.0  200.0  215.0  250.0  04/01/2017  17/07/14  195

 ************************* DataFrame.dtypes *********************

accounts              str
Feb                 float
Jan                   int
Mar                   int
Apr                   int
datetime    datetime.date
dates       datetime.date
res                   int

### DataFrameColumn.week_of_year()

In [25]:
# Returns the number of weeks from the beginning of the year to the specified date or timestamp value in a column as a literal.

df = df_sales.assign(res = df_sales.dates.week_of_year())
print_variables(df)

Equivalent SQL: select accounts AS accounts, "Feb" AS "Feb", "Jan" AS "Jan", "Mar" AS "Mar", "Apr" AS "Apr", datetime AS datetime, dates AS dates, WeekNumber_Of_Year(dates, 'Teradata') AS res from (select accounts AS accounts, "Feb" AS "Feb", "Jan" AS "Jan", "Mar" AS "Mar", "Apr" AS "Apr", datetime AS datetime, CASE WHEN (accounts = 'Alpha Co') THEN datetime + 191 WHEN (accounts = 'Blue Inc') THEN datetime + 56 WHEN (accounts = 'Jones LLC') THEN datetime + 440 WHEN (accounts = 'Orange Inc') THEN datetime + 395 WHEN (accounts = 'Yellow Inc') THEN datetime + 362 WHEN (accounts = 'Red Inc') THEN datetime + 233 END AS dates from "sales") as temp_table


 ************************* DataFrame *********************

              Feb    Jan    Mar    Apr    datetime     dates  res
accounts
Blue Inc     90.0   50.0   95.0  101.0  04/01/2017  17/03/01    9
Red Inc     200.0  150.0  140.0    NaN  04/01/2017  17/08/25   34
Yellow Inc   90.0    NaN    NaN    NaN  04/01/2017  18/01/01    0
Jones LLC   200.0  150.0  140.0  180.0  04/01/2017  18/03/20   11
Orange Inc  210.0    NaN    NaN  250.0  04/01/2017  18/02/03    4
Alpha Co    210.0  200.0  215.0  250.0  04/01/2017  17/07/14   28

 ************************* DataFrame.dtypes *********************

accounts              str
Feb                 float
Jan                   int
Mar                   int
Apr                   int
datetime    datetime.date
dates       datetime.date
res                   int

### DataFrameColumn.month_of_year()

In [26]:
# Returns the number of months from the beginning of the year to the specified date or timestamp value in a column as a literal.

df = df_sales.assign(res = df_sales.dates.month_of_year())
print_variables(df)

Equivalent SQL: select accounts AS accounts, "Feb" AS "Feb", "Jan" AS "Jan", "Mar" AS "Mar", "Apr" AS "Apr", datetime AS datetime, dates AS dates, MonthNumber_Of_Year(dates, 'Teradata') AS res from (select accounts AS accounts, "Feb" AS "Feb", "Jan" AS "Jan", "Mar" AS "Mar", "Apr" AS "Apr", datetime AS datetime, CASE WHEN (accounts = 'Alpha Co') THEN datetime + 191 WHEN (accounts = 'Blue Inc') THEN datetime + 56 WHEN (accounts = 'Jones LLC') THEN datetime + 440 WHEN (accounts = 'Orange Inc') THEN datetime + 395 WHEN (accounts = 'Yellow Inc') THEN datetime + 362 WHEN (accounts = 'Red Inc') THEN datetime + 233 END AS dates from "sales") as temp_table


 ************************* DataFrame *********************

              Feb    Jan    Mar    Apr    datetime     dates  res
accounts
Blue Inc     90.0   50.0   95.0  101.0  04/01/2017  17/03/01    3
Red Inc     200.0  150.0  140.0    NaN  04/01/2017  17/08/25    8
Yellow Inc   90.0    NaN    NaN    NaN  04/01/2017  18/01/01    1
Jones LLC   200.0  150.0  140.0  180.0  04/01/2017  18/03/20    3
Orange Inc  210.0    NaN    NaN  250.0  04/01/2017  18/02/03    2
Alpha Co    210.0  200.0  215.0  250.0  04/01/2017  17/07/14    7

 ************************* DataFrame.dtypes *********************

accounts              str
Feb                 float
Jan                   int
Mar                   int
Apr                   int
datetime    datetime.date
dates       datetime.date
res                   int

### DataFrameColumn.week_of_quarter()

In [27]:
# Returns the number of weeks from the beginning of the quarter to the specified date or timestamp value in a column as a literal.

df = df_sales.assign(res = df_sales.dates.week_of_quarter())
print_variables(df)

Equivalent SQL: select accounts AS accounts, "Feb" AS "Feb", "Jan" AS "Jan", "Mar" AS "Mar", "Apr" AS "Apr", datetime AS datetime, dates AS dates, WeekNumber_Of_Quarter(dates, 'Teradata') AS res from (select accounts AS accounts, "Feb" AS "Feb", "Jan" AS "Jan", "Mar" AS "Mar", "Apr" AS "Apr", datetime AS datetime, CASE WHEN (accounts = 'Alpha Co') THEN datetime + 191 WHEN (accounts = 'Blue Inc') THEN datetime + 56 WHEN (accounts = 'Jones LLC') THEN datetime + 440 WHEN (accounts = 'Orange Inc') THEN datetime + 395 WHEN (accounts = 'Yellow Inc') THEN datetime + 362 WHEN (accounts = 'Red Inc') THEN datetime + 233 END AS dates from "sales") as temp_table


 ************************* DataFrame *********************

              Feb    Jan    Mar    Apr    datetime     dates  res
accounts
Blue Inc     90.0   50.0   95.0  101.0  04/01/2017  17/03/01    9
Red Inc     200.0  150.0  140.0    NaN  04/01/2017  17/08/25    8
Yellow Inc   90.0    NaN    NaN    NaN  04/01/2017  18/01/01    0
Jones LLC   200.0  150.0  140.0  180.0  04/01/2017  18/03/20   11
Orange Inc  210.0    NaN    NaN  250.0  04/01/2017  18/02/03    4
Alpha Co    210.0  200.0  215.0  250.0  04/01/2017  17/07/14    2

 ************************* DataFrame.dtypes *********************

accounts              str
Feb                 float
Jan                   int
Mar                   int
Apr                   int
datetime    datetime.date
dates       datetime.date
res                   int

### DataFrameColumn.month_of_quarter()

In [28]:
# Returns the number of months from the beginning of the quarter to the specified date or timestamp value in a column as a literal.

df = df_sales.assign(res = df_sales.dates.month_of_quarter())
print_variables(df)

Equivalent SQL: select accounts AS accounts, "Feb" AS "Feb", "Jan" AS "Jan", "Mar" AS "Mar", "Apr" AS "Apr", datetime AS datetime, dates AS dates, MonthNumber_Of_Quarter(dates, 'Teradata') AS res from (select accounts AS accounts, "Feb" AS "Feb", "Jan" AS "Jan", "Mar" AS "Mar", "Apr" AS "Apr", datetime AS datetime, CASE WHEN (accounts = 'Alpha Co') THEN datetime + 191 WHEN (accounts = 'Blue Inc') THEN datetime + 56 WHEN (accounts = 'Jones LLC') THEN datetime + 440 WHEN (accounts = 'Orange Inc') THEN datetime + 395 WHEN (accounts = 'Yellow Inc') THEN datetime + 362 WHEN (accounts = 'Red Inc') THEN datetime + 233 END AS dates from "sales") as temp_table


 ************************* DataFrame *********************

              Feb    Jan    Mar    Apr    datetime     dates  res
accounts
Blue Inc     90.0   50.0   95.0  101.0  04/01/2017  17/03/01    3
Red Inc     200.0  150.0  140.0    NaN  04/01/2017  17/08/25    2
Yellow Inc   90.0    NaN    NaN    NaN  04/01/2017  18/01/01    1
Jones LLC   200.0  150.0  140.0  180.0  04/01/2017  18/03/20    3
Orange Inc  210.0    NaN    NaN  250.0  04/01/2017  18/02/03    2
Alpha Co    210.0  200.0  215.0  250.0  04/01/2017  17/07/14    1

 ************************* DataFrame.dtypes *********************

accounts              str
Feb                 float
Jan                   int
Mar                   int
Apr                   int
datetime    datetime.date
dates       datetime.date
res                   int

### DataFrameColumn.quarter_of_year()

In [29]:
# Returns the number of quarters from the beginning of the year to the specified date or timestamp value in a column as a literal.

df = df_sales.assign(res = df_sales.dates.quarter_of_year())
print_variables(df)

Equivalent SQL: select accounts AS accounts, "Feb" AS "Feb", "Jan" AS "Jan", "Mar" AS "Mar", "Apr" AS "Apr", datetime AS datetime, dates AS dates, QuarterNumber_Of_Year(dates, 'Teradata') AS res from (select accounts AS accounts, "Feb" AS "Feb", "Jan" AS "Jan", "Mar" AS "Mar", "Apr" AS "Apr", datetime AS datetime, CASE WHEN (accounts = 'Alpha Co') THEN datetime + 191 WHEN (accounts = 'Blue Inc') THEN datetime + 56 WHEN (accounts = 'Jones LLC') THEN datetime + 440 WHEN (accounts = 'Orange Inc') THEN datetime + 395 WHEN (accounts = 'Yellow Inc') THEN datetime + 362 WHEN (accounts = 'Red Inc') THEN datetime + 233 END AS dates from "sales") as temp_table


 ************************* DataFrame *********************

              Feb    Jan    Mar    Apr    datetime     dates  res
accounts
Alpha Co    210.0  200.0  215.0  250.0  04/01/2017  17/07/14    3
Blue Inc     90.0   50.0   95.0  101.0  04/01/2017  17/03/01    1
Jones LLC   200.0  150.0  140.0  180.0  04/01/2017  18/03/20    1
Orange Inc  210.0    NaN    NaN  250.0  04/01/2017  18/02/03    1
Yellow Inc   90.0    NaN    NaN    NaN  04/01/2017  18/01/01    1
Red Inc     200.0  150.0  140.0    NaN  04/01/2017  17/08/25    3

 ************************* DataFrame.dtypes *********************

accounts              str
Feb                 float
Jan                   int
Mar                   int
Apr                   int
datetime    datetime.date
dates       datetime.date
res                   int

### DataFrameColumn.day_of_calendar()

In [30]:
# Returns the number of days from the beginning of the business calendar to the specified date or timestamp value in a column as a literal.

df = df_sales.assign(res = df_sales.dates.day_of_calendar())
print_variables(df)

Equivalent SQL: select accounts AS accounts, "Feb" AS "Feb", "Jan" AS "Jan", "Mar" AS "Mar", "Apr" AS "Apr", datetime AS datetime, dates AS dates, DayNumber_Of_Calendar(dates, 'Teradata') AS res from (select accounts AS accounts, "Feb" AS "Feb", "Jan" AS "Jan", "Mar" AS "Mar", "Apr" AS "Apr", datetime AS datetime, CASE WHEN (accounts = 'Alpha Co') THEN datetime + 191 WHEN (accounts = 'Blue Inc') THEN datetime + 56 WHEN (accounts = 'Jones LLC') THEN datetime + 440 WHEN (accounts = 'Orange Inc') THEN datetime + 395 WHEN (accounts = 'Yellow Inc') THEN datetime + 362 WHEN (accounts = 'Red Inc') THEN datetime + 233 END AS dates from "sales") as temp_table


 ************************* DataFrame *********************

              Feb    Jan    Mar    Apr    datetime     dates    res
accounts
Blue Inc     90.0   50.0   95.0  101.0  04/01/2017  17/03/01  42794
Red Inc     200.0  150.0  140.0    NaN  04/01/2017  17/08/25  42971
Yellow Inc   90.0    NaN    NaN    NaN  04/01/2017  18/01/01  43100
Jones LLC   200.0  150.0  140.0  180.0  04/01/2017  18/03/20  43178
Orange Inc  210.0    NaN    NaN  250.0  04/01/2017  18/02/03  43133
Alpha Co    210.0  200.0  215.0  250.0  04/01/2017  17/07/14  42929

 ************************* DataFrame.dtypes *********************

accounts              str
Feb                 float
Jan                   int
Mar                   int
Apr                   int
datetime    datetime.date
dates       datetime.date
res                   int

### DataFrameColumn.week_of_calendar()

In [31]:
# Returns the number of weeks from the beginning of the calendar to the specified date or timestamp value in a column as a literal.

df = df_sales.assign(res = df_sales.dates.week_of_calendar())
print_variables(df)

Equivalent SQL: select accounts AS accounts, "Feb" AS "Feb", "Jan" AS "Jan", "Mar" AS "Mar", "Apr" AS "Apr", datetime AS datetime, dates AS dates, WeekNumber_Of_Calendar(dates, 'Teradata') AS res from (select accounts AS accounts, "Feb" AS "Feb", "Jan" AS "Jan", "Mar" AS "Mar", "Apr" AS "Apr", datetime AS datetime, CASE WHEN (accounts = 'Alpha Co') THEN datetime + 191 WHEN (accounts = 'Blue Inc') THEN datetime + 56 WHEN (accounts = 'Jones LLC') THEN datetime + 440 WHEN (accounts = 'Orange Inc') THEN datetime + 395 WHEN (accounts = 'Yellow Inc') THEN datetime + 362 WHEN (accounts = 'Red Inc') THEN datetime + 233 END AS dates from "sales") as temp_table


 ************************* DataFrame *********************

              Feb    Jan    Mar    Apr    datetime     dates   res
accounts
Blue Inc     90.0   50.0   95.0  101.0  04/01/2017  17/03/01  6113
Red Inc     200.0  150.0  140.0    NaN  04/01/2017  17/08/25  6138
Yellow Inc   90.0    NaN    NaN    NaN  04/01/2017  18/01/01  6157
Jones LLC   200.0  150.0  140.0  180.0  04/01/2017  18/03/20  6168
Orange Inc  210.0    NaN    NaN  250.0  04/01/2017  18/02/03  6161
Alpha Co    210.0  200.0  215.0  250.0  04/01/2017  17/07/14  6132

 ************************* DataFrame.dtypes *********************

accounts              str
Feb                 float
Jan                   int
Mar                   int
Apr                   int
datetime    datetime.date
dates       datetime.date
res                   int

### DataFrameColumn.month_of_calendar()

In [32]:
# Returns the number of months from the beginning of the calendar to the specified date or timestamp value in a column as a literal.

df = df_sales.assign(res = df_sales.dates.month_of_calendar())
print_variables(df)

Equivalent SQL: select accounts AS accounts, "Feb" AS "Feb", "Jan" AS "Jan", "Mar" AS "Mar", "Apr" AS "Apr", datetime AS datetime, dates AS dates, MonthNumber_Of_Calendar(dates, 'Teradata') AS res from (select accounts AS accounts, "Feb" AS "Feb", "Jan" AS "Jan", "Mar" AS "Mar", "Apr" AS "Apr", datetime AS datetime, CASE WHEN (accounts = 'Alpha Co') THEN datetime + 191 WHEN (accounts = 'Blue Inc') THEN datetime + 56 WHEN (accounts = 'Jones LLC') THEN datetime + 440 WHEN (accounts = 'Orange Inc') THEN datetime + 395 WHEN (accounts = 'Yellow Inc') THEN datetime + 362 WHEN (accounts = 'Red Inc') THEN datetime + 233 END AS dates from "sales") as temp_table


 ************************* DataFrame *********************

              Feb    Jan    Mar    Apr    datetime     dates   res
accounts
Blue Inc     90.0   50.0   95.0  101.0  04/01/2017  17/03/01  1407
Red Inc     200.0  150.0  140.0    NaN  04/01/2017  17/08/25  1412
Yellow Inc   90.0    NaN    NaN    NaN  04/01/2017  18/01/01  1417
Jones LLC   200.0  150.0  140.0  180.0  04/01/2017  18/03/20  1419
Orange Inc  210.0    NaN    NaN  250.0  04/01/2017  18/02/03  1418
Alpha Co    210.0  200.0  215.0  250.0  04/01/2017  17/07/14  1411

 ************************* DataFrame.dtypes *********************

accounts              str
Feb                 float
Jan                   int
Mar                   int
Apr                   int
datetime    datetime.date
dates       datetime.date
res                   int

### DataFrameColumn.quarter_of_calendar()

In [33]:
# Returns the number of quarters from the beginning of the calendar to the specified date or timestamp value in a column as a literal.
df = df_sales.assign(res = df_sales.dates.quarter_of_calendar())
print_variables(df)

Equivalent SQL: select accounts AS accounts, "Feb" AS "Feb", "Jan" AS "Jan", "Mar" AS "Mar", "Apr" AS "Apr", datetime AS datetime, dates AS dates, QuarterNumber_Of_Calendar(dates, 'Teradata') AS res from (select accounts AS accounts, "Feb" AS "Feb", "Jan" AS "Jan", "Mar" AS "Mar", "Apr" AS "Apr", datetime AS datetime, CASE WHEN (accounts = 'Alpha Co') THEN datetime + 191 WHEN (accounts = 'Blue Inc') THEN datetime + 56 WHEN (accounts = 'Jones LLC') THEN datetime + 440 WHEN (accounts = 'Orange Inc') THEN datetime + 395 WHEN (accounts = 'Yellow Inc') THEN datetime + 362 WHEN (accounts = 'Red Inc') THEN datetime + 233 END AS dates from "sales") as temp_table


 ************************* DataFrame *********************

              Feb    Jan    Mar    Apr    datetime     dates  res
accounts
Alpha Co    210.0  200.0  215.0  250.0  04/01/2017  17/07/14  471
Blue Inc     90.0   50.0   95.0  101.0  04/01/2017  17/03/01  469
Jones LLC   200.0  150.0  140.0  180.0  04/01/2017  18/03/20  473
Orange Inc  210.0    NaN    NaN  250.0  04/01/2017  18/02/03  473
Yellow Inc   90.0    NaN    NaN    NaN  04/01/2017  18/01/01  473
Red Inc     200.0  150.0  140.0    NaN  04/01/2017  17/08/25  471

 ************************* DataFrame.dtypes *********************

accounts              str
Feb                 float
Jan                   int
Mar                   int
Apr                   int
datetime    datetime.date
dates       datetime.date
res                   int

### DataFrameColumn.year_of_calendar()

In [34]:
# Returns the year of the specified date or timestamp value in a column as a literal.

df = df_sales.assign(res = df_sales.dates.year_of_calendar())
print_variables(df)

Equivalent SQL: select accounts AS accounts, "Feb" AS "Feb", "Jan" AS "Jan", "Mar" AS "Mar", "Apr" AS "Apr", datetime AS datetime, dates AS dates, YearNumber_Of_Calendar(dates, 'Teradata') AS res from (select accounts AS accounts, "Feb" AS "Feb", "Jan" AS "Jan", "Mar" AS "Mar", "Apr" AS "Apr", datetime AS datetime, CASE WHEN (accounts = 'Alpha Co') THEN datetime + 191 WHEN (accounts = 'Blue Inc') THEN datetime + 56 WHEN (accounts = 'Jones LLC') THEN datetime + 440 WHEN (accounts = 'Orange Inc') THEN datetime + 395 WHEN (accounts = 'Yellow Inc') THEN datetime + 362 WHEN (accounts = 'Red Inc') THEN datetime + 233 END AS dates from "sales") as temp_table


 ************************* DataFrame *********************

              Feb    Jan    Mar    Apr    datetime     dates   res
accounts
Alpha Co    210.0  200.0  215.0  250.0  04/01/2017  17/07/14  2017
Blue Inc     90.0   50.0   95.0  101.0  04/01/2017  17/03/01  2017
Jones LLC   200.0  150.0  140.0  180.0  04/01/2017  18/03/20  2018
Orange Inc  210.0    NaN    NaN  250.0  04/01/2017  18/02/03  2018
Yellow Inc   90.0    NaN    NaN    NaN  04/01/2017  18/01/01  2018
Red Inc     200.0  150.0  140.0    NaN  04/01/2017  17/08/25  2017

 ************************* DataFrame.dtypes *********************

accounts              str
Feb                 float
Jan                   int
Mar                   int
Apr                   int
datetime    datetime.date
dates       datetime.date
res                   int

### DataFrameColumn.week()

In [35]:
# Returns the number of weeks from the beginning of the year to the specified date or timestamp value in a column as a literal.

df = df_sales.assign(res = df_sales.dates.week())
print_variables(df)

Equivalent SQL: select accounts AS accounts, "Feb" AS "Feb", "Jan" AS "Jan", "Mar" AS "Mar", "Apr" AS "Apr", datetime AS datetime, dates AS dates, week(dates) AS res from (select accounts AS accounts, "Feb" AS "Feb", "Jan" AS "Jan", "Mar" AS "Mar", "Apr" AS "Apr", datetime AS datetime, CASE WHEN (accounts = 'Alpha Co') THEN datetime + 191 WHEN (accounts = 'Blue Inc') THEN datetime + 56 WHEN (accounts = 'Jones LLC') THEN datetime + 440 WHEN (accounts = 'Orange Inc') THEN datetime + 395 WHEN (accounts = 'Yellow Inc') THEN datetime + 362 WHEN (accounts = 'Red Inc') THEN datetime + 233 END AS dates from "sales") as temp_table


 ************************* DataFrame *********************

              Feb    Jan    Mar    Apr    datetime     dates  res
accounts
Alpha Co    210.0  200.0  215.0  250.0  04/01/2017  17/07/14   28
Blue Inc     90.0   50.0   95.0  101.0  04/01/2017  17/03/01    9
Jones LLC   200.0  150.0  140.0  180.0  04/01/2017  18/03/20   12
Orange Inc  210.0    NaN    NaN  250.0  04/01/2017  18/02/03    5
Yellow Inc   90.0    NaN    NaN    NaN  04/01/2017  18/01/01    1
Red Inc     200.0  150.0  140.0    NaN  04/01/2017  17/08/25   34

 ************************* DataFrame.dtypes *********************

accounts              str
Feb                 float
Jan                   int
Mar                   int
Apr                   int
datetime    datetime.date
dates       datetime.date
res                   int

### DataFrameColumn.next_day()

In [36]:
# Returns the date of the first weekday specified as 'day_value' that is later than the specified date or timestamp value in a column as a literal.
df = df_sales.assign(res = df_sales.dates.next_day("SUNDAY"))
print_variables(df)

Equivalent SQL: select accounts AS accounts, "Feb" AS "Feb", "Jan" AS "Jan", "Mar" AS "Mar", "Apr" AS "Apr", datetime AS datetime, dates AS dates, next_day(dates, 'SUNDAY') AS res from (select accounts AS accounts, "Feb" AS "Feb", "Jan" AS "Jan", "Mar" AS "Mar", "Apr" AS "Apr", datetime AS datetime, CASE WHEN (accounts = 'Alpha Co') THEN datetime + 191 WHEN (accounts = 'Blue Inc') THEN datetime + 56 WHEN (accounts = 'Jones LLC') THEN datetime + 440 WHEN (accounts = 'Orange Inc') THEN datetime + 395 WHEN (accounts = 'Yellow Inc') THEN datetime + 362 WHEN (accounts = 'Red Inc') THEN datetime + 233 END AS dates from "sales") as temp_table


 ************************* DataFrame *********************

              Feb    Jan    Mar    Apr    datetime     dates       res
accounts
Alpha Co    210.0  200.0  215.0  250.0  04/01/2017  17/07/14  17/07/16
Blue Inc     90.0   50.0   95.0  101.0  04/01/2017  17/03/01  17/03/05
Jones LLC   200.0  150.0  140.0  180.0  04/01/2017  18/03/20  18/03/25
Orange Inc  210.0    NaN    NaN  250.0  04/01/2017  18/02/03  18/02/04
Yellow Inc   90.0    NaN    NaN    NaN  04/01/2017  18/01/01  18/01/07
Red Inc     200.0  150.0  140.0    NaN  04/01/2017  17/08/25  17/08/27

 ************************* DataFrame.dtypes *********************

accounts              str
Feb                 float
Jan                   int
Mar                   int
Apr                   int
datetime    datetime.date
dates       datetime.date
res         datetime.date

### DataFrameColumn.months_between()

In [37]:
# Returns the number of months between value in specified date or timestamp value in a column as a literal and date or timestamp value in argument.
# It returns an integer value only when the two dates are same else it returns the fractional portion of the result based on a 31-day month
df = df_sales.assign(res = df_sales.dates.months_between(df_sales.datetime))
print_variables(df)

Equivalent SQL: select accounts AS accounts, "Feb" AS "Feb", "Jan" AS "Jan", "Mar" AS "Mar", "Apr" AS "Apr", datetime AS datetime, dates AS dates, months_between(dates, datetime) AS res from (select accounts AS accounts, "Feb" AS "Feb", "Jan" AS "Jan", "Mar" AS "Mar", "Apr" AS "Apr", datetime AS datetime, CASE WHEN (accounts = 'Alpha Co') THEN datetime + 191 WHEN (accounts = 'Blue Inc') THEN datetime + 56 WHEN (accounts = 'Jones LLC') THEN datetime + 440 WHEN (accounts = 'Orange Inc') THEN datetime + 395 WHEN (accounts = 'Yellow Inc') THEN datetime + 362 WHEN (accounts = 'Red Inc') THEN datetime + 233 END AS dates from "sales") as temp_table


 ************************* DataFrame *********************

              Feb    Jan    Mar    Apr    datetime     dates        res
accounts
Alpha Co    210.0  200.0  215.0  250.0  04/01/2017  17/07/14   6.322581
Blue Inc     90.0   50.0   95.0  101.0  04/01/2017  17/03/01   1.903226
Jones LLC   200.0  150.0  140.0  180.0  04/01/2017  18/03/20  14.516129
Orange Inc  210.0    NaN    NaN  250.0  04/01/2017  18/02/03  12.967742
Yellow Inc   90.0    NaN    NaN    NaN  04/01/2017  18/01/01  11.903226
Red Inc     200.0  150.0  140.0    NaN  04/01/2017  17/08/25   7.677419

 ************************* DataFrame.dtypes *********************

accounts              str
Feb                 float
Jan                   int
Mar                   int
Apr                   int
datetime    datetime.date
dates       datetime.date
res                   int

### DataFrameColumn.add_months()

In [38]:
# Adds an integer number of months to specified date or timestamp value in a column as a literal.

df = df_sales.assign(res = df_sales.dates.add_months(2))
print_variables(df)

Equivalent SQL: select accounts AS accounts, "Feb" AS "Feb", "Jan" AS "Jan", "Mar" AS "Mar", "Apr" AS "Apr", datetime AS datetime, dates AS dates, add_months(dates, 2) AS res from (select accounts AS accounts, "Feb" AS "Feb", "Jan" AS "Jan", "Mar" AS "Mar", "Apr" AS "Apr", datetime AS datetime, CASE WHEN (accounts = 'Alpha Co') THEN datetime + 191 WHEN (accounts = 'Blue Inc') THEN datetime + 56 WHEN (accounts = 'Jones LLC') THEN datetime + 440 WHEN (accounts = 'Orange Inc') THEN datetime + 395 WHEN (accounts = 'Yellow Inc') THEN datetime + 362 WHEN (accounts = 'Red Inc') THEN datetime + 233 END AS dates from "sales") as temp_table


 ************************* DataFrame *********************

              Feb    Jan    Mar    Apr    datetime     dates         res
accounts
Blue Inc     90.0   50.0   95.0  101.0  04/01/2017  17/03/01  2017-05-01
Red Inc     200.0  150.0  140.0    NaN  04/01/2017  17/08/25  2017-10-25
Yellow Inc   90.0    NaN    NaN    NaN  04/01/2017  18/01/01  2018-03-01
Jones LLC   200.0  150.0  140.0  180.0  04/01/2017  18/03/20  2018-05-20
Orange Inc  210.0    NaN    NaN  250.0  04/01/2017  18/02/03  2018-04-03
Alpha Co    210.0  200.0  215.0  250.0  04/01/2017  17/07/14  2017-09-14

 ************************* DataFrame.dtypes *********************

accounts              str
Feb                 float
Jan                   int
Mar                   int
Apr                   int
datetime    datetime.date
dates       datetime.date
res         datetime.date

### DataFrameColumn.oadd_months()

In [39]:
# Adds an integer number of months, date or timestamp value in specified date or timestamp value in a column as a literal.
df = df_sales.assign(res = df_sales.dates.oadd_months(3))
print_variables(df)

Equivalent SQL: select accounts AS accounts, "Feb" AS "Feb", "Jan" AS "Jan", "Mar" AS "Mar", "Apr" AS "Apr", datetime AS datetime, dates AS dates, oadd_months(dates, 3) AS res from (select accounts AS accounts, "Feb" AS "Feb", "Jan" AS "Jan", "Mar" AS "Mar", "Apr" AS "Apr", datetime AS datetime, CASE WHEN (accounts = 'Alpha Co') THEN datetime + 191 WHEN (accounts = 'Blue Inc') THEN datetime + 56 WHEN (accounts = 'Jones LLC') THEN datetime + 440 WHEN (accounts = 'Orange Inc') THEN datetime + 395 WHEN (accounts = 'Yellow Inc') THEN datetime + 362 WHEN (accounts = 'Red Inc') THEN datetime + 233 END AS dates from "sales") as temp_table


 ************************* DataFrame *********************

              Feb    Jan    Mar    Apr    datetime     dates       res
accounts
Alpha Co    210.0  200.0  215.0  250.0  04/01/2017  17/07/14  17/10/14
Blue Inc     90.0   50.0   95.0  101.0  04/01/2017  17/03/01  17/06/01
Jones LLC   200.0  150.0  140.0  180.0  04/01/2017  18/03/20  18/06/20
Orange Inc  210.0    NaN    NaN  250.0  04/01/2017  18/02/03  18/05/03
Yellow Inc   90.0    NaN    NaN    NaN  04/01/2017  18/01/01  18/04/01
Red Inc     200.0  150.0  140.0    NaN  04/01/2017  17/08/25  17/11/25

 ************************* DataFrame.dtypes *********************

accounts              str
Feb                 float
Jan                   int
Mar                   int
Apr                   int
datetime    datetime.date
dates       datetime.date
res         datetime.date

### DataFrameColumn.year()

In [40]:
# Returns the integer value for year in the specified date or timestamp value in a column as a literal.
df = df_sales.assign(res = df_sales.dates.year())
print_variables(df)

Equivalent SQL: select accounts AS accounts, "Feb" AS "Feb", "Jan" AS "Jan", "Mar" AS "Mar", "Apr" AS "Apr", datetime AS datetime, dates AS dates, year(dates) AS res from (select accounts AS accounts, "Feb" AS "Feb", "Jan" AS "Jan", "Mar" AS "Mar", "Apr" AS "Apr", datetime AS datetime, CASE WHEN (accounts = 'Alpha Co') THEN datetime + 191 WHEN (accounts = 'Blue Inc') THEN datetime + 56 WHEN (accounts = 'Jones LLC') THEN datetime + 440 WHEN (accounts = 'Orange Inc') THEN datetime + 395 WHEN (accounts = 'Yellow Inc') THEN datetime + 362 WHEN (accounts = 'Red Inc') THEN datetime + 233 END AS dates from "sales") as temp_table


 ************************* DataFrame *********************

              Feb    Jan    Mar    Apr    datetime     dates   res
accounts
Blue Inc     90.0   50.0   95.0  101.0  04/01/2017  17/03/01  2017
Red Inc     200.0  150.0  140.0    NaN  04/01/2017  17/08/25  2017
Yellow Inc   90.0    NaN    NaN    NaN  04/01/2017  18/01/01  2018
Jones LLC   200.0  150.0  140.0  180.0  04/01/2017  18/03/20  2018
Orange Inc  210.0    NaN    NaN  250.0  04/01/2017  18/02/03  2018
Alpha Co    210.0  200.0  215.0  250.0  04/01/2017  17/07/14  2017

 ************************* DataFrame.dtypes *********************

accounts              str
Feb                 float
Jan                   int
Mar                   int
Apr                   int
datetime    datetime.date
dates       datetime.date
res                   int

### DataFrameColumn.month()

In [41]:
# Returns the integer value for months in the specified date or timestamp value in a column as a literal.
df = df_sales.assign(res = df_sales.dates.month())
print_variables(df)

Equivalent SQL: select accounts AS accounts, "Feb" AS "Feb", "Jan" AS "Jan", "Mar" AS "Mar", "Apr" AS "Apr", datetime AS datetime, dates AS dates, month(dates) AS res from (select accounts AS accounts, "Feb" AS "Feb", "Jan" AS "Jan", "Mar" AS "Mar", "Apr" AS "Apr", datetime AS datetime, CASE WHEN (accounts = 'Alpha Co') THEN datetime + 191 WHEN (accounts = 'Blue Inc') THEN datetime + 56 WHEN (accounts = 'Jones LLC') THEN datetime + 440 WHEN (accounts = 'Orange Inc') THEN datetime + 395 WHEN (accounts = 'Yellow Inc') THEN datetime + 362 WHEN (accounts = 'Red Inc') THEN datetime + 233 END AS dates from "sales") as temp_table


 ************************* DataFrame *********************

              Feb    Jan    Mar    Apr    datetime     dates  res
accounts
Blue Inc     90.0   50.0   95.0  101.0  04/01/2017  17/03/01    3
Red Inc     200.0  150.0  140.0    NaN  04/01/2017  17/08/25    8
Yellow Inc   90.0    NaN    NaN    NaN  04/01/2017  18/01/01    1
Jones LLC   200.0  150.0  140.0  180.0  04/01/2017  18/03/20    3
Orange Inc  210.0    NaN    NaN  250.0  04/01/2017  18/02/03    2
Alpha Co    210.0  200.0  215.0  250.0  04/01/2017  17/07/14    7

 ************************* DataFrame.dtypes *********************

accounts              str
Feb                 float
Jan                   int
Mar                   int
Apr                   int
datetime    datetime.date
dates       datetime.date
res                   int

In [42]:
# Loading another dataset for timestamp related functions.
load_example_data("dataframe", ["ocean_buoys"])
ocean_df = DataFrame.from_table('ocean_buoys')
print_variables(ocean_df)

WARNING: Skipped loading table ocean_buoys since it already exists in the database.
Equivalent SQL: select * from "ocean_buoys"


 ************************* DataFrame *********************

                       TD_TIMECODE  salinity  temperature
buoyid
1       2014-01-06 09:02:25.122200        55           78
1       2014-01-06 09:03:25.122200        55           79
1       2014-01-06 09:03:25.122200        55           72
0       2014-01-06 08:00:00.000000        55           10
0       2014-01-06 08:09:59.999999        55           99
0       2014-01-06 08:10:00.000000        55           10
0       2014-01-06 08:10:00.000000        55          100
44      2014-01-06 10:00:24.000000        55           43
44      2014-01-06 10:00:24.333300        55           43
44      2014-01-06 10:00:25.122200        55           43

 ************************* DataFrame.dtypes *********************

TD_TIMECODE    datetime.datetime
buoyid                       int
salinity                     int
temperature                  int

### DataFrameColumn.hour()

In [43]:
# Returns the integer value for hour in the specified timestamp value in a column as a literal.
res_df = ocean_df.assign(res = ocean_df.TD_TIMECODE.hour())
print_variables(res_df)

Equivalent SQL: select "TD_TIMECODE" AS "TD_TIMECODE", buoyid AS buoyid, salinity AS salinity, temperature AS temperature, hour("TD_TIMECODE") AS res from "ocean_buoys"


 ************************* DataFrame *********************

                       TD_TIMECODE  salinity  temperature  res
buoyid
1       2014-01-06 09:02:25.122200        55           78    9
1       2014-01-06 09:03:25.122200        55           79    9
1       2014-01-06 09:03:25.122200        55           72    9
0       2014-01-06 08:00:00.000000        55           10    8
0       2014-01-06 08:09:59.999999        55           99    8
0       2014-01-06 08:10:00.000000        55           10    8
0       2014-01-06 08:10:00.000000        55          100    8
44      2014-01-06 10:00:24.000000        55           43   10
44      2014-01-06 10:00:24.333300        55           43   10
44      2014-01-06 10:00:25.122200        55           43   10

 ************************* DataFrame.dtypes *********************

TD_TIMECODE    datetime.datetime
buoyid                       int
salinity                     int
temperature                  int
res                          int

### DataFrameColumn.minute()

In [44]:
# Returns the integer value for minute in the specified timestamp value in a column as a literal.
res_df = ocean_df.assign(res = ocean_df.TD_TIMECODE.minute())
print_variables(res_df)

Equivalent SQL: select "TD_TIMECODE" AS "TD_TIMECODE", buoyid AS buoyid, salinity AS salinity, temperature AS temperature, minute("TD_TIMECODE") AS res from "ocean_buoys"


 ************************* DataFrame *********************

                       TD_TIMECODE  salinity  temperature  res
buoyid
0       2014-01-06 08:09:59.999999        55           99    9
0       2014-01-06 08:10:00.000000        55          100   10
44      2014-01-06 10:00:24.000000        55           43    0
44      2014-01-06 10:00:24.333300        55           43    0
44      2014-01-06 10:00:26.122200        55           43    0
44      2014-01-06 10:01:25.122200        55           53    1
1       2014-01-06 09:01:25.122200        55           77    1
1       2014-01-06 09:01:25.122200        55           70    1
1       2014-01-06 09:02:25.122200        55           78    2
1       2014-01-06 09:02:25.122200        55           71    2

 ************************* DataFrame.dtypes *********************

TD_TIMECODE    datetime.datetime
buoyid                       int
salinity                     int
temperature                  int
res                          int

### DataFrameColumn.second()

In [45]:
# Returns the integer value for seconds in the specified timestamp value in a column as a literal.
res_df = ocean_df.assign(res = ocean_df.TD_TIMECODE.second())
print_variables(res_df)

Equivalent SQL: select "TD_TIMECODE" AS "TD_TIMECODE", buoyid AS buoyid, salinity AS salinity, temperature AS temperature, second("TD_TIMECODE") AS res from "ocean_buoys"


 ************************* DataFrame *********************

                       TD_TIMECODE  salinity  temperature   res
buoyid
0       2014-01-06 08:09:59.999999        55         99.0  59.0
0       2014-01-06 08:10:00.000000        55        100.0   0.0
44      2014-01-06 10:00:24.000000        55         43.0  24.0
44      2014-01-06 10:00:24.333300        55         43.0  24.0
44      2014-01-06 10:00:26.122200        55         43.0  26.0
44      2014-01-06 10:01:25.122200        55         53.0  25.0
44      2014-01-06 10:00:25.122200        55         43.0  25.0
0       2014-01-06 08:10:00.000000        55         10.0   0.0
0       2014-01-06 08:08:59.999999        55          NaN  59.0
0       2014-01-06 08:00:00.000000        55         10.0   0.0

 ************************* DataFrame.dtypes *********************

TD_TIMECODE    datetime.datetime
buoyid                       int
salinity                     int
temperature                  int
res              decimal.Decimal

## When session parameter calendar is not set.

In [46]:
# When nothing is specified it takes the default value of argument as "Teradata"
df = df_sales.assign(res = df_sales.dates.day_of_week()).sort('accounts')
print_variables(df)

Equivalent SQL: select accounts AS accounts, "Feb" AS "Feb", "Jan" AS "Jan", "Mar" AS "Mar", "Apr" AS "Apr", datetime AS datetime, dates AS dates, DayNumber_Of_Week(dates, 'Teradata') AS res from (select accounts AS accounts, "Feb" AS "Feb", "Jan" AS "Jan", "Mar" AS "Mar", "Apr" AS "Apr", datetime AS datetime, CASE WHEN (accounts = 'Alpha Co') THEN datetime + 191 WHEN (accounts = 'Blue Inc') THEN datetime + 56 WHEN (accounts = 'Jones LLC') THEN datetime + 440 WHEN (accounts = 'Orange Inc') THEN datetime + 395 WHEN (accounts = 'Yellow Inc') THEN datetime + 362 WHEN (accounts = 'Red Inc') THEN datetime + 233 END AS dates from "sales") as temp_table


 ************************* DataFrame *********************

              Feb    Jan    Mar    Apr    datetime     dates  res
accounts
Alpha Co    210.0  200.0  215.0  250.0  04/01/2017  17/07/14    6
Blue Inc     90.0   50.0   95.0  101.0  04/01/2017  17/03/01    4
Jones LLC   200.0  150.0  140.0  180.0  04/01/2017  18/03/20    3
Orange Inc  210.0    NaN    NaN  250.0  04/01/2017  18/02/03    7
Red Inc     200.0  150.0  140.0    NaN  04/01/2017  17/08/25    6
Yellow Inc   90.0    NaN    NaN    NaN  04/01/2017  18/01/01    2

 ************************* DataFrame.dtypes *********************

accounts              str
Feb                 float
Jan                   int
Mar                   int
Apr                   int
datetime    datetime.date
dates       datetime.date
res                   int

In [47]:
# When None is specified it takes the default value of argument as "Teradata"
df = df_sales.assign(res = df_sales.dates.day_of_week(None)).sort('accounts')
print_variables(df)

Equivalent SQL: select accounts AS accounts, "Feb" AS "Feb", "Jan" AS "Jan", "Mar" AS "Mar", "Apr" AS "Apr", datetime AS datetime, dates AS dates, DayNumber_Of_Week(dates, NULL) AS res from (select accounts AS accounts, "Feb" AS "Feb", "Jan" AS "Jan", "Mar" AS "Mar", "Apr" AS "Apr", datetime AS datetime, CASE WHEN (accounts = 'Alpha Co') THEN datetime + 191 WHEN (accounts = 'Blue Inc') THEN datetime + 56 WHEN (accounts = 'Jones LLC') THEN datetime + 440 WHEN (accounts = 'Orange Inc') THEN datetime + 395 WHEN (accounts = 'Yellow Inc') THEN datetime + 362 WHEN (accounts = 'Red Inc') THEN datetime + 233 END AS dates from "sales") as temp_table


 ************************* DataFrame *********************

              Feb    Jan    Mar    Apr    datetime     dates  res
accounts
Alpha Co    210.0  200.0  215.0  250.0  04/01/2017  17/07/14    6
Blue Inc     90.0   50.0   95.0  101.0  04/01/2017  17/03/01    4
Jones LLC   200.0  150.0  140.0  180.0  04/01/2017  18/03/20    3
Orange Inc  210.0    NaN    NaN  250.0  04/01/2017  18/02/03    7
Red Inc     200.0  150.0  140.0    NaN  04/01/2017  17/08/25    6
Yellow Inc   90.0    NaN    NaN    NaN  04/01/2017  18/01/01    2

 ************************* DataFrame.dtypes *********************

accounts              str
Feb                 float
Jan                   int
Mar                   int
Apr                   int
datetime    datetime.date
dates       datetime.date
res                   int

In [48]:
# When "Teradata" is specified it takes the calendar_name as "Teradata"
df = df_sales.assign(res = df_sales.dates.day_of_week("Teradata")).sort('accounts')
print_variables(df)

Equivalent SQL: select accounts AS accounts, "Feb" AS "Feb", "Jan" AS "Jan", "Mar" AS "Mar", "Apr" AS "Apr", datetime AS datetime, dates AS dates, DayNumber_Of_Week(dates, 'Teradata') AS res from (select accounts AS accounts, "Feb" AS "Feb", "Jan" AS "Jan", "Mar" AS "Mar", "Apr" AS "Apr", datetime AS datetime, CASE WHEN (accounts = 'Alpha Co') THEN datetime + 191 WHEN (accounts = 'Blue Inc') THEN datetime + 56 WHEN (accounts = 'Jones LLC') THEN datetime + 440 WHEN (accounts = 'Orange Inc') THEN datetime + 395 WHEN (accounts = 'Yellow Inc') THEN datetime + 362 WHEN (accounts = 'Red Inc') THEN datetime + 233 END AS dates from "sales") as temp_table


 ************************* DataFrame *********************

              Feb    Jan    Mar    Apr    datetime     dates  res
accounts
Alpha Co    210.0  200.0  215.0  250.0  04/01/2017  17/07/14    6
Blue Inc     90.0   50.0   95.0  101.0  04/01/2017  17/03/01    4
Jones LLC   200.0  150.0  140.0  180.0  04/01/2017  18/03/20    3
Orange Inc  210.0    NaN    NaN  250.0  04/01/2017  18/02/03    7
Red Inc     200.0  150.0  140.0    NaN  04/01/2017  17/08/25    6
Yellow Inc   90.0    NaN    NaN    NaN  04/01/2017  18/01/01    2

 ************************* DataFrame.dtypes *********************

accounts              str
Feb                 float
Jan                   int
Mar                   int
Apr                   int
datetime    datetime.date
dates       datetime.date
res                   int

In [49]:
# When "ISO" is specified it takes the calendar_name as "ISO"
df = df_sales.assign(res = df_sales.dates.day_of_week("ISO")).sort('accounts')
print_variables(df)

Equivalent SQL: select accounts AS accounts, "Feb" AS "Feb", "Jan" AS "Jan", "Mar" AS "Mar", "Apr" AS "Apr", datetime AS datetime, dates AS dates, DayNumber_Of_Week(dates, 'ISO') AS res from (select accounts AS accounts, "Feb" AS "Feb", "Jan" AS "Jan", "Mar" AS "Mar", "Apr" AS "Apr", datetime AS datetime, CASE WHEN (accounts = 'Alpha Co') THEN datetime + 191 WHEN (accounts = 'Blue Inc') THEN datetime + 56 WHEN (accounts = 'Jones LLC') THEN datetime + 440 WHEN (accounts = 'Orange Inc') THEN datetime + 395 WHEN (accounts = 'Yellow Inc') THEN datetime + 362 WHEN (accounts = 'Red Inc') THEN datetime + 233 END AS dates from "sales") as temp_table


 ************************* DataFrame *********************

              Feb    Jan    Mar    Apr    datetime     dates  res
accounts
Alpha Co    210.0  200.0  215.0  250.0  04/01/2017  17/07/14    5
Blue Inc     90.0   50.0   95.0  101.0  04/01/2017  17/03/01    3
Jones LLC   200.0  150.0  140.0  180.0  04/01/2017  18/03/20    2
Orange Inc  210.0    NaN    NaN  250.0  04/01/2017  18/02/03    6
Red Inc     200.0  150.0  140.0    NaN  04/01/2017  17/08/25    5
Yellow Inc   90.0    NaN    NaN    NaN  04/01/2017  18/01/01    1

 ************************* DataFrame.dtypes *********************

accounts              str
Feb                 float
Jan                   int
Mar                   int
Apr                   int
datetime    datetime.date
dates       datetime.date
res                   int

In [50]:
# When "Compatible" is specified it takes the calendar_name as "Compatible"
df = df_sales.assign(res = df_sales.dates.day_of_week("Compatible")).sort('accounts')
print_variables(df)

Equivalent SQL: select accounts AS accounts, "Feb" AS "Feb", "Jan" AS "Jan", "Mar" AS "Mar", "Apr" AS "Apr", datetime AS datetime, dates AS dates, DayNumber_Of_Week(dates, 'Compatible') AS res from (select accounts AS accounts, "Feb" AS "Feb", "Jan" AS "Jan", "Mar" AS "Mar", "Apr" AS "Apr", datetime AS datetime, CASE WHEN (accounts = 'Alpha Co') THEN datetime + 191 WHEN (accounts = 'Blue Inc') THEN datetime + 56 WHEN (accounts = 'Jones LLC') THEN datetime + 440 WHEN (accounts = 'Orange Inc') THEN datetime + 395 WHEN (accounts = 'Yellow Inc') THEN datetime + 362 WHEN (accounts = 'Red Inc') THEN datetime + 233 END AS dates from "sales") as temp_table


 ************************* DataFrame *********************

              Feb    Jan    Mar    Apr    datetime     dates  res
accounts
Alpha Co    210.0  200.0  215.0  250.0  04/01/2017  17/07/14    6
Blue Inc     90.0   50.0   95.0  101.0  04/01/2017  17/03/01    4
Jones LLC   200.0  150.0  140.0  180.0  04/01/2017  18/03/20    2
Orange Inc  210.0    NaN    NaN  250.0  04/01/2017  18/02/03    6
Red Inc     200.0  150.0  140.0    NaN  04/01/2017  17/08/25    6
Yellow Inc   90.0    NaN    NaN    NaN  04/01/2017  18/01/01    1

 ************************* DataFrame.dtypes *********************

accounts              str
Feb                 float
Jan                   int
Mar                   int
Apr                   int
datetime    datetime.date
dates       datetime.date
res                   int

## When session parameter calendar is set to ISO.

In [51]:
set_session_param("calendar", "iso")

True

In [52]:
# When None is set as calendar name it by defaults considers the calendar set for the session
df = df_sales.assign(res = df_sales.dates.day_of_week(None)).sort('accounts')
print_variables(df)

Equivalent SQL: select accounts AS accounts, "Feb" AS "Feb", "Jan" AS "Jan", "Mar" AS "Mar", "Apr" AS "Apr", datetime AS datetime, dates AS dates, DayNumber_Of_Week(dates, NULL) AS res from (select accounts AS accounts, "Feb" AS "Feb", "Jan" AS "Jan", "Mar" AS "Mar", "Apr" AS "Apr", datetime AS datetime, CASE WHEN (accounts = 'Alpha Co') THEN datetime + 191 WHEN (accounts = 'Blue Inc') THEN datetime + 56 WHEN (accounts = 'Jones LLC') THEN datetime + 440 WHEN (accounts = 'Orange Inc') THEN datetime + 395 WHEN (accounts = 'Yellow Inc') THEN datetime + 362 WHEN (accounts = 'Red Inc') THEN datetime + 233 END AS dates from "sales") as temp_table


 ************************* DataFrame *********************

              Feb    Jan    Mar    Apr    datetime     dates  res
accounts
Alpha Co    210.0  200.0  215.0  250.0  04/01/2017  17/07/14    5
Blue Inc     90.0   50.0   95.0  101.0  04/01/2017  17/03/01    3
Jones LLC   200.0  150.0  140.0  180.0  04/01/2017  18/03/20    2
Orange Inc  210.0    NaN    NaN  250.0  04/01/2017  18/02/03    6
Red Inc     200.0  150.0  140.0    NaN  04/01/2017  17/08/25    5
Yellow Inc   90.0    NaN    NaN    NaN  04/01/2017  18/01/01    1

 ************************* DataFrame.dtypes *********************

accounts              str
Feb                 float
Jan                   int
Mar                   int
Apr                   int
datetime    datetime.date
dates       datetime.date
res                   int

In [53]:
# When nothing is specified it takes the default value of argument as "Teradata"
df = df_sales.assign(res = df_sales.dates.day_of_week()).sort('accounts')
print_variables(df)

Equivalent SQL: select accounts AS accounts, "Feb" AS "Feb", "Jan" AS "Jan", "Mar" AS "Mar", "Apr" AS "Apr", datetime AS datetime, dates AS dates, DayNumber_Of_Week(dates, 'Teradata') AS res from (select accounts AS accounts, "Feb" AS "Feb", "Jan" AS "Jan", "Mar" AS "Mar", "Apr" AS "Apr", datetime AS datetime, CASE WHEN (accounts = 'Alpha Co') THEN datetime + 191 WHEN (accounts = 'Blue Inc') THEN datetime + 56 WHEN (accounts = 'Jones LLC') THEN datetime + 440 WHEN (accounts = 'Orange Inc') THEN datetime + 395 WHEN (accounts = 'Yellow Inc') THEN datetime + 362 WHEN (accounts = 'Red Inc') THEN datetime + 233 END AS dates from "sales") as temp_table


 ************************* DataFrame *********************

              Feb    Jan    Mar    Apr    datetime     dates  res
accounts
Alpha Co    210.0  200.0  215.0  250.0  04/01/2017  17/07/14    6
Blue Inc     90.0   50.0   95.0  101.0  04/01/2017  17/03/01    4
Jones LLC   200.0  150.0  140.0  180.0  04/01/2017  18/03/20    3
Orange Inc  210.0    NaN    NaN  250.0  04/01/2017  18/02/03    7
Red Inc     200.0  150.0  140.0    NaN  04/01/2017  17/08/25    6
Yellow Inc   90.0    NaN    NaN    NaN  04/01/2017  18/01/01    2

 ************************* DataFrame.dtypes *********************

accounts              str
Feb                 float
Jan                   int
Mar                   int
Apr                   int
datetime    datetime.date
dates       datetime.date
res                   int

In [54]:
# When "Teradata" is specified it takes the calendar_name as "Teradata"
df = df_sales.assign(res = df_sales.dates.day_of_week("Teradata")).sort('accounts')
print_variables(df)

Equivalent SQL: select accounts AS accounts, "Feb" AS "Feb", "Jan" AS "Jan", "Mar" AS "Mar", "Apr" AS "Apr", datetime AS datetime, dates AS dates, DayNumber_Of_Week(dates, 'Teradata') AS res from (select accounts AS accounts, "Feb" AS "Feb", "Jan" AS "Jan", "Mar" AS "Mar", "Apr" AS "Apr", datetime AS datetime, CASE WHEN (accounts = 'Alpha Co') THEN datetime + 191 WHEN (accounts = 'Blue Inc') THEN datetime + 56 WHEN (accounts = 'Jones LLC') THEN datetime + 440 WHEN (accounts = 'Orange Inc') THEN datetime + 395 WHEN (accounts = 'Yellow Inc') THEN datetime + 362 WHEN (accounts = 'Red Inc') THEN datetime + 233 END AS dates from "sales") as temp_table


 ************************* DataFrame *********************

              Feb    Jan    Mar    Apr    datetime     dates  res
accounts
Alpha Co    210.0  200.0  215.0  250.0  04/01/2017  17/07/14    6
Blue Inc     90.0   50.0   95.0  101.0  04/01/2017  17/03/01    4
Jones LLC   200.0  150.0  140.0  180.0  04/01/2017  18/03/20    3
Orange Inc  210.0    NaN    NaN  250.0  04/01/2017  18/02/03    7
Red Inc     200.0  150.0  140.0    NaN  04/01/2017  17/08/25    6
Yellow Inc   90.0    NaN    NaN    NaN  04/01/2017  18/01/01    2

 ************************* DataFrame.dtypes *********************

accounts              str
Feb                 float
Jan                   int
Mar                   int
Apr                   int
datetime    datetime.date
dates       datetime.date
res                   int

In [55]:
# When "ISO" is specified it takes the calendar_name as "ISO"
df = df_sales.assign(res = df_sales.dates.day_of_week("ISO")).sort('accounts')
print_variables(df)

Equivalent SQL: select accounts AS accounts, "Feb" AS "Feb", "Jan" AS "Jan", "Mar" AS "Mar", "Apr" AS "Apr", datetime AS datetime, dates AS dates, DayNumber_Of_Week(dates, 'ISO') AS res from (select accounts AS accounts, "Feb" AS "Feb", "Jan" AS "Jan", "Mar" AS "Mar", "Apr" AS "Apr", datetime AS datetime, CASE WHEN (accounts = 'Alpha Co') THEN datetime + 191 WHEN (accounts = 'Blue Inc') THEN datetime + 56 WHEN (accounts = 'Jones LLC') THEN datetime + 440 WHEN (accounts = 'Orange Inc') THEN datetime + 395 WHEN (accounts = 'Yellow Inc') THEN datetime + 362 WHEN (accounts = 'Red Inc') THEN datetime + 233 END AS dates from "sales") as temp_table


 ************************* DataFrame *********************

              Feb    Jan    Mar    Apr    datetime     dates  res
accounts
Alpha Co    210.0  200.0  215.0  250.0  04/01/2017  17/07/14    5
Blue Inc     90.0   50.0   95.0  101.0  04/01/2017  17/03/01    3
Jones LLC   200.0  150.0  140.0  180.0  04/01/2017  18/03/20    2
Orange Inc  210.0    NaN    NaN  250.0  04/01/2017  18/02/03    6
Red Inc     200.0  150.0  140.0    NaN  04/01/2017  17/08/25    5
Yellow Inc   90.0    NaN    NaN    NaN  04/01/2017  18/01/01    1

 ************************* DataFrame.dtypes *********************

accounts              str
Feb                 float
Jan                   int
Mar                   int
Apr                   int
datetime    datetime.date
dates       datetime.date
res                   int

In [56]:
# When "Compatible" is specified it takes the calendar_name as "Compatible"
df = df_sales.assign(res = df_sales.dates.day_of_week("Compatible")).sort('accounts')
print_variables(df)

Equivalent SQL: select accounts AS accounts, "Feb" AS "Feb", "Jan" AS "Jan", "Mar" AS "Mar", "Apr" AS "Apr", datetime AS datetime, dates AS dates, DayNumber_Of_Week(dates, 'Compatible') AS res from (select accounts AS accounts, "Feb" AS "Feb", "Jan" AS "Jan", "Mar" AS "Mar", "Apr" AS "Apr", datetime AS datetime, CASE WHEN (accounts = 'Alpha Co') THEN datetime + 191 WHEN (accounts = 'Blue Inc') THEN datetime + 56 WHEN (accounts = 'Jones LLC') THEN datetime + 440 WHEN (accounts = 'Orange Inc') THEN datetime + 395 WHEN (accounts = 'Yellow Inc') THEN datetime + 362 WHEN (accounts = 'Red Inc') THEN datetime + 233 END AS dates from "sales") as temp_table


 ************************* DataFrame *********************

              Feb    Jan    Mar    Apr    datetime     dates  res
accounts
Alpha Co    210.0  200.0  215.0  250.0  04/01/2017  17/07/14    6
Blue Inc     90.0   50.0   95.0  101.0  04/01/2017  17/03/01    4
Jones LLC   200.0  150.0  140.0  180.0  04/01/2017  18/03/20    2
Orange Inc  210.0    NaN    NaN  250.0  04/01/2017  18/02/03    6
Red Inc     200.0  150.0  140.0    NaN  04/01/2017  17/08/25    6
Yellow Inc   90.0    NaN    NaN    NaN  04/01/2017  18/01/01    1

 ************************* DataFrame.dtypes *********************

accounts              str
Feb                 float
Jan                   int
Mar                   int
Apr                   int
datetime    datetime.date
dates       datetime.date
res                   int

### DataFrameColumn.to_timestamp()

In [57]:
# Load the data for to_timestamp function.
load_example_data("teradataml", "timestamp_data")
df = DataFrame("timestamp_data")
print_variables(df)

WARNING: Skipped loading table timestamp_data since it already exists in the database.
Equivalent SQL: select * from "timestamp_data"


 ************************* DataFrame *********************

                  timestamp_col  timestamp_col1                         format_col     timezone_col
id
2   2015-01-08 00:00:12.2+10:00     45678910234  YYYY-MM-DD HH24:MI:SS.FF6 TZH:TZM           GMT+10
1              2015-01-08 13:00          878986                 YYYY-MM-DD HH24:MI  America Pacific
0         2015-01-08 00:00:12.2          123456          YYYY-MM-DD HH24:MI:SS.FF6              GMT

 ************************* DataFrame.dtypes *********************

id                int
timestamp_col     str
timestamp_col1    int
format_col        str
timezone_col      str

In [58]:
# Convert Epoch seconds to timestamp.
df1 = df.select(['id','timestamp_col1']).assign(col = df.timestamp_col1.to_timestamp())
print_variables(df1)

Equivalent SQL: select id AS id, timestamp_col1 AS timestamp_col1, to_timestamp(timestamp_col1) AS col from (select id,timestamp_col1 from "timestamp_data") as temp_table


 ************************* DataFrame *********************

    timestamp_col1                         col
id
0           123456  1970-01-02 10:17:36.000000
2      45678910234  3417-07-05 02:10:34.000000
1           878986  1970-01-11 04:09:46.000000

 ************************* DataFrame.dtypes *********************

id                              int
timestamp_col1                  int
col               datetime.datetime

In [59]:
# Convert timestamp string to timestamp with timezone in format mentioned in column "format_col".
df1 = df.select(['id', 'timestamp_col', 'format_col']).assign(col = df.timestamp_col.to_timestamp(df.format_col, TIMESTAMP(timezone=True)))
print_variables(df1)

Equivalent SQL: select id AS id, timestamp_col AS timestamp_col, format_col AS format_col, to_timestamp_tz(timestamp_col, format_col) AS col from (select id,timestamp_col,format_col from "timestamp_data") as temp_table


 ************************* DataFrame *********************

                  timestamp_col                         format_col                             col
id
0         2015-01-08 00:00:12.2          YYYY-MM-DD HH24:MI:SS.FF6  2015-01-08 00:00:12.200000+00:
2   2015-01-08 00:00:12.2+10:00  YYYY-MM-DD HH24:MI:SS.FF6 TZH:TZM  2015-01-08 00:00:12.200000+10:
1              2015-01-08 13:00                 YYYY-MM-DD HH24:MI  2015-01-08 13:00:00.000000+00:

 ************************* DataFrame.dtypes *********************

id                             int
timestamp_col                  str
format_col                     str
col              datetime.datetime

### DataFrameColumn.extract()

In [60]:
# Load the data for extract function.
load_example_data("uaf", "Traindata")
temp_df = DataFrame("Traindata")
df = temp_df.select(["seq_no", "schedule_date", "arrivalTime"])
print_variables(df)

WARNING: Skipped loading table Traindata since it already exists in the database.
Equivalent SQL: select seq_no,schedule_date,"arrivalTime" from "Traindata"


 ************************* DataFrame *********************

       schedule_date          arrivalTime
seq_no
13          16/03/26  2016-03-26 11:33:00
9           16/03/26  2016-03-26 11:19:06
16          16/03/26  2016-03-26 11:51:00
19          16/03/26  2016-03-26 12:07:06
26          16/03/26  2016-03-26 12:33:05
5           16/03/26  2016-03-26 11:03:06
24          16/03/26  2016-03-26 12:25:06
3           16/03/26  2016-03-26 10:52:05
7           16/03/26  2016-03-26 11:10:06
11          16/03/26  2016-03-26 11:26:00

 ************************* DataFrame.dtypes *********************

seq_no                         int
schedule_date        datetime.date
arrivalTime      datetime.datetime

In [61]:
# Extract hour from column 'arrivalTime'.
df1 = df.assign(col = df.arrivalTime.extract('HOUR'))
print_variables(df1)

Equivalent SQL: select seq_no AS seq_no, schedule_date AS schedule_date, "arrivalTime" AS "arrivalTime", EXTRACT(HOUR FROM "arrivalTime") AS col from (select seq_no,schedule_date,"arrivalTime" from "Traindata") as temp_table


 ************************* DataFrame *********************

       schedule_date          arrivalTime col
seq_no
13          16/03/26  2016-03-26 11:33:00  11
9           16/03/26  2016-03-26 11:19:06  11
16          16/03/26  2016-03-26 11:51:00  11
19          16/03/26  2016-03-26 12:07:06  12
26          16/03/26  2016-03-26 12:33:05  12
5           16/03/26  2016-03-26 11:03:06  11
24          16/03/26  2016-03-26 12:25:06  12
3           16/03/26  2016-03-26 10:52:05  10
7           16/03/26  2016-03-26 11:10:06  11
11          16/03/26  2016-03-26 11:26:00  11

 ************************* DataFrame.dtypes *********************

seq_no                         int
schedule_date        datetime.date
arrivalTime      datetime.datetime
col                            int

### DataFrameColumn.to_interval()

In [62]:
# Load the data for to_interval() function.
load_example_data("teradataml", "interval_data")
df = DataFrame("interval_data")
print_variables(df)

WARNING: Skipped loading table interval_data since it already exists in the database.
Equivalent SQL: select * from "interval_data"


 ************************* DataFrame *********************

    int_col value_col value_col1        str_col1 str_col2
id
1       240      HOUR       YEAR  P100DT4H23M59S  P100Y4M
2       657    MINUTE      MONTH           PT73H    -P14M
3      1234    SECOND      MONTH    100 04:23:59    06-10
0        20       DAY       YEAR    100 04:23:59    04-10

 ************************* DataFrame.dtypes *********************

id            int
int_col       int
value_col     str
value_col1    str
str_col1      str
str_col2      str

In [63]:
# Convert int_col to INTERVAL_YEAR_TO_MONTH when value = 'MONTH'.
df = df.assign(col = df.int_col.to_interval('MONTH', INTERVAL_YEAR_TO_MONTH))
print_variables(df)

Equivalent SQL: select id AS id, int_col AS int_col, value_col AS value_col, value_col1 AS value_col1, str_col1 AS str_col1, str_col2 AS str_col2, numtoyminterval(int_col, 'MONTH') AS col from "interval_data"


 ************************* DataFrame *********************

    int_col value_col value_col1        str_col1 str_col2       col
id
1       240      HOUR       YEAR  P100DT4H23M59S  P100Y4M     20-00
2       657    MINUTE      MONTH           PT73H    -P14M     54-09
3      1234    SECOND      MONTH    100 04:23:59    06-10    102-10
0        20       DAY       YEAR    100 04:23:59    04-10      1-08

 ************************* DataFrame.dtypes *********************

id            int
int_col       int
value_col     str
value_col1    str
str_col1      str
str_col2      str
col           str

### DataFrameColumn.trunc()

In [64]:
# Truncate the value of 'dates' to beginning of the month.
df = df_sales.assign(res = df_sales.dates.trunc(formatter="MON")).sort('accounts')
print_variables(df)

Equivalent SQL: select accounts AS accounts, "Feb" AS "Feb", "Jan" AS "Jan", "Mar" AS "Mar", "Apr" AS "Apr", datetime AS datetime, dates AS dates, trunc(dates, 'MON') AS res from (select accounts AS accounts, "Feb" AS "Feb", "Jan" AS "Jan", "Mar" AS "Mar", "Apr" AS "Apr", datetime AS datetime, CASE WHEN (accounts = 'Alpha Co') THEN datetime + 191 WHEN (accounts = 'Blue Inc') THEN datetime + 56 WHEN (accounts = 'Jones LLC') THEN datetime + 440 WHEN (accounts = 'Orange Inc') THEN datetime + 395 WHEN (accounts = 'Yellow Inc') THEN datetime + 362 WHEN (accounts = 'Red Inc') THEN datetime + 233 END AS dates from "sales") as temp_table


 ************************* DataFrame *********************

              Feb    Jan    Mar    Apr    datetime     dates       res
accounts
Alpha Co    210.0  200.0  215.0  250.0  04/01/2017  17/07/14  17/07/01
Blue Inc     90.0   50.0   95.0  101.0  04/01/2017  17/03/01  17/03/01
Jones LLC   200.0  150.0  140.0  180.0  04/01/2017  18/03/20  18/03/01
Orange Inc  210.0    NaN    NaN  250.0  04/01/2017  18/02/03  18/02/01
Red Inc     200.0  150.0  140.0    NaN  04/01/2017  17/08/25  17/08/01
Yellow Inc   90.0    NaN    NaN    NaN  04/01/2017  18/01/01  18/01/01

 ************************* DataFrame.dtypes *********************

accounts              str
Feb                 float
Jan                   int
Mar                   int
Apr                   int
datetime    datetime.date
dates       datetime.date
res                   str

### DataFrameColumn.to_date()

In [65]:
# convert 'dates' col to VARCHAR type for to_date function.
new_df = df_sales.assign(timevalue_char=df_sales.dates.to_char('DD-MON-YYYY'))
print_variables(new_df)

Equivalent SQL: select accounts AS accounts, "Feb" AS "Feb", "Jan" AS "Jan", "Mar" AS "Mar", "Apr" AS "Apr", datetime AS datetime, dates AS dates, to_char(dates, 'DD-MON-YYYY') AS timevalue_char from (select accounts AS accounts, "Feb" AS "Feb", "Jan" AS "Jan", "Mar" AS "Mar", "Apr" AS "Apr", datetime AS datetime, CASE WHEN (accounts = 'Alpha Co') THEN datetime + 191 WHEN (accounts = 'Blue Inc') THEN datetime + 56 WHEN (accounts = 'Jones LLC') THEN datetime + 440 WHEN (accounts = 'Orange Inc') THEN datetime + 395 WHEN (accounts = 'Yellow Inc') THEN datetime + 362 WHEN (accounts = 'Red Inc') THEN datetime + 233 END AS dates from "sales") as temp_table


 ************************* DataFrame *********************

              Feb    Jan    Mar    Apr    datetime     dates timevalue_char
accounts
Alpha Co    210.0  200.0  215.0  250.0  04/01/2017  17/07/14    14-JUL-2017
Blue Inc     90.0   50.0   95.0  101.0  04/01/2017  17/03/01    01-MAR-2017
Jones LLC   200.0  150.0  140.0  180.0  04/01/2017  18/03/20    20-MAR-2018
Orange Inc  210.0    NaN    NaN  250.0  04/01/2017  18/02/03    03-FEB-2018
Yellow Inc   90.0    NaN    NaN    NaN  04/01/2017  18/01/01    01-JAN-2018
Red Inc     200.0  150.0  140.0    NaN  04/01/2017  17/08/25    25-AUG-2017

 ************************* DataFrame.dtypes *********************

accounts                    str
Feb                       float
Jan                         int
Mar                         int
Apr                         int
datetime          datetime.date
dates             datetime.date
timevalue_char              str

In [66]:
# convert "timevalue_char" column to DATE type.
res = new_df.assign(timevalue_char=new_df.timevalue_char.to_date('DD-MON-YYYY'))
print_variables(res)

Equivalent SQL: select accounts AS accounts, "Feb" AS "Feb", "Jan" AS "Jan", "Mar" AS "Mar", "Apr" AS "Apr", datetime AS datetime, dates AS dates, to_date(timevalue_char, 'DD-MON-YYYY') AS timevalue_char from (select accounts AS accounts, "Feb" AS "Feb", "Jan" AS "Jan", "Mar" AS "Mar", "Apr" AS "Apr", datetime AS datetime, dates AS dates, to_char(dates, 'DD-MON-YYYY') AS timevalue_char from (select accounts AS accounts, "Feb" AS "Feb", "Jan" AS "Jan", "Mar" AS "Mar", "Apr" AS "Apr", datetime AS datetime, CASE WHEN (accounts = 'Alpha Co') THEN datetime + 191 WHEN (accounts = 'Blue Inc') THEN datetime + 56 WHEN (accounts = 'Jones LLC') THEN datetime + 440 WHEN (accounts = 'Orange Inc') THEN datetime + 395 WHEN (accounts = 'Yellow Inc') THEN datetime + 362 WHEN (accounts = 'Red Inc') THEN datetime + 233 END AS dates from "sales") as temp_table) as temp_table


 ************************* DataFrame *********************

              Feb    Jan    Mar    Apr    datetime     dates timevalue_char
accounts
Alpha Co    210.0  200.0  215.0  250.0  04/01/2017  17/07/14       17/07/14
Blue Inc     90.0   50.0   95.0  101.0  04/01/2017  17/03/01       17/03/01
Jones LLC   200.0  150.0  140.0  180.0  04/01/2017  18/03/20       18/03/20
Orange Inc  210.0    NaN    NaN  250.0  04/01/2017  18/02/03       18/02/03
Yellow Inc   90.0    NaN    NaN    NaN  04/01/2017  18/01/01       18/01/01
Red Inc     200.0  150.0  140.0    NaN  04/01/2017  17/08/25       17/08/25

 ************************* DataFrame.dtypes *********************

accounts                    str
Feb                       float
Jan                         int
Mar                         int
Apr                         int
datetime          datetime.date
dates             datetime.date
timevalue_char    datetime.date

### Convert VARCHAR type column to DATE type column.

In [67]:
# Create DataSet for cast function.
dict_data = {"id": [1], "col": ['20050101']}
pandas_df = pd.DataFrame(dict_data)
copy_to_sql(pandas_df, table_name="cast_dataset", if_exists="replace")
df = DataFrame("cast_dataset")
print_variables(df)

Equivalent SQL: select * from "cast_dataset"


 ************************* DataFrame *********************

   id       col
0   1  20050101

 ************************* DataFrame.dtypes *********************

id     int
col    str

In [68]:
# DataFrameColumn.cast() converts 'VARCHAR' column to 'DATE' using format
df1 = df.assign(new_col=df.col.cast(DATE, format='YYYYMMDD'))
print_variables(df1)

Equivalent SQL: select id AS id, col AS col, CAST(col AS DATE FORMAT 'YYYYMMDD') AS new_col from "cast_dataset"


 ************************* DataFrame *********************

   id       col   new_col
0   1  20050101  20050101

 ************************* DataFrame.dtypes *********************

id                   int
col                  str
new_col    datetime.date

### Convert VARCHAR type column to TIMESTAMP type column.

In [69]:
# Create DataSet for cast function.
dict_data = {"id": [1], "col": ['1000-01-10 23:00:12-02:00']}
pandas_df = pd.DataFrame(dict_data)
copy_to_sql(pandas_df, table_name="cast_dataset", if_exists="replace")
df = DataFrame("cast_dataset")
print_variables(df)

Equivalent SQL: select * from "cast_dataset"


 ************************* DataFrame *********************

   id                        col
0   1  1000-01-10 23:00:12-02:00

 ************************* DataFrame.dtypes *********************

id     int
col    str

In [70]:
# DataFrameColumn.cast() converts 'VARCHAR' column to 'TIMESTAMP' using format
df1 = df.assign(new_col=df.col.cast(TIMESTAMP, 'Y4-MM-DDBHH:MI:SSBZ'))
print_variables(df1)

Equivalent SQL: select id AS id, col AS col, CAST(col AS TIMESTAMP(6) FORMAT 'Y4-MM-DDBHH:MI:SSBZ') AS new_col from "cast_dataset"


 ************************* DataFrame *********************

   id                        col              new_col
0   1  1000-01-10 23:00:12-02:00  1000-01-11 01:00:12

 ************************* DataFrame.dtypes *********************

id                       int
col                      str
new_col    datetime.datetime

### Convert VARCHAR type column to TIME type column.

In [71]:
# Create DataSet for cast function.
dict_data = {"id": [1], "col": ['10:15:12']}
pandas_df = pd.DataFrame(dict_data)
copy_to_sql(pandas_df, table_name="cast_dataset", if_exists="replace")
df = DataFrame("cast_dataset")
print_variables(df)

Equivalent SQL: select * from "cast_dataset"


 ************************* DataFrame *********************

   id       col
0   1  10:15:12

 ************************* DataFrame.dtypes *********************

id     int
col    str

In [72]:
# DataFrameColumn.cast() converts 'VARCHAR' column to 'TIME' using format
df1 = df.assign(new_col=df.col.cast(TIME(), 'HH:MI:SSBZ'))
print_variables(df1)

Equivalent SQL: select id AS id, col AS col, CAST(col AS TIME(6) FORMAT 'HH:MI:SSBZ') AS new_col from "cast_dataset"


 ************************* DataFrame *********************

   id       col   new_col
0   1  10:15:12  10:15:12

 ************************* DataFrame.dtypes *********************

id                   int
col                  str
new_col    datetime.time

### Convert TIMESTAMP type column to TIMESTAMP WITH TIMEZONE type column.

In [73]:
# Create DataSet for cast function.
dict_data = {"id": [1], "col": ['2002-02-20 10:15:30']}
pandas_df = pd.DataFrame(dict_data)
copy_to_sql(pandas_df, table_name="cast_dataset", if_exists="replace")
df = DataFrame("cast_dataset")
df = df.assign(col=df.col.cast(TIMESTAMP))
print_variables(df)

Equivalent SQL: select id AS id, CAST(col AS TIMESTAMP(6)) AS col from "cast_dataset"


 ************************* DataFrame *********************

   id                         col
0   1  2002-02-20 10:15:30.000000

 ************************* DataFrame.dtypes *********************

id                   int
col    datetime.datetime

In [74]:
# DataFrameColumn.cast() converts 'TIMESTAMP' column to 'TIMESTAMP WITH TIMEZONE' to timezone 'AMERICA PACIFIC'.
df1 = df.assign(new_col=df.col.cast(TIMESTAMP(timezone=True), timezone='AMERICA PACIFIC'))
print_variables(df1)

Equivalent SQL: select id AS id, col AS col, CAST(col AS TIMESTAMP(6) WITH TIME ZONE AT TIME ZONE 'AMERICA PACIFIC') AS new_col from (select id AS id, CAST(col AS TIMESTAMP(6)) AS col from "cast_dataset") as temp_table


 ************************* DataFrame *********************

   id                         col                         new_col
0   1  2002-02-20 10:15:30.000000  2002-02-20 02:15:30.000000-08:

 ************************* DataFrame.dtypes *********************

id                       int
col        datetime.datetime
new_col    datetime.datetime

### Convert TIMESTAMP type column to VARCHAR type column.

In [75]:
# Create DataSet for cast function.
dict_data = {"id": [1], "col": ['2002-02-20 10:15:30']}
pandas_df = pd.DataFrame(dict_data)
copy_to_sql(pandas_df, table_name="cast_dataset", if_exists="replace")
df = DataFrame("cast_dataset")
df = df.assign(col=df.col.cast(TIMESTAMP))
print_variables(df)

Equivalent SQL: select id AS id, CAST(col AS TIMESTAMP(6)) AS col from "cast_dataset"


 ************************* DataFrame *********************

   id                         col
0   1  2002-02-20 10:15:30.000000

 ************************* DataFrame.dtypes *********************

id                   int
col    datetime.datetime

In [76]:
# DataFrameColumn.cast() converts 'TIMESTAMP' column to 'VARCHAR' with format.
df1 = df.assign(new_col=df.col.cast(VARCHAR, format='M3BDD,BY4BHHhMIm'))
print_variables(df1)

Equivalent SQL: select id AS id, col AS col, CAST(CAST(col AS FORMAT 'M3BDD,BY4BHHhMIm') AS LONG VARCHAR) AS new_col from (select id AS id, CAST(col AS TIMESTAMP(6)) AS col from "cast_dataset") as temp_table


 ************************* DataFrame *********************

   id                         col              new_col
0   1  2002-02-20 10:15:30.000000  Feb 20, 2002 10h15m

 ************************* DataFrame.dtypes *********************

id                       int
col        datetime.datetime
new_col                  str

### Subtract two timestamp columns

In [77]:
# Load the dataset
load_example_data("uaf", "Convolve2RealsLeft")
timestamp_df = DataFrame("Convolve2RealsLeft")
timestamp_df = timestamp_df.select(["id", "row_i_time", "column_i_time"])
print_variables(timestamp_df)

WARNING: Skipped loading table Convolve2RealsLeft since it already exists in the database.
Equivalent SQL: select id,row_i_time,column_i_time from "Convolve2RealsLeft"


 ************************* DataFrame *********************

                    row_i_time               column_i_time
id
1   2018-08-08 08:02:00.000000  2018-08-08 08:00:00.000000
1   2018-08-08 08:02:00.000000  2018-08-08 08:02:00.000000
1   2018-08-08 08:00:00.000000  2018-08-08 08:02:00.000000
1   2018-08-08 08:00:00.000000  2018-08-08 08:00:00.000000

 ************************* DataFrame.dtypes *********************

id                             int
row_i_time       datetime.datetime
column_i_time    datetime.datetime

In [78]:
# Subtract 2 timestamp columns and assign to new column 'seconds'.
df1 = timestamp_df.assign(seconds = timestamp_df.row_i_time-timestamp_df.column_i_time)
print_variables(df1)

Equivalent SQL: select id AS id, row_i_time AS row_i_time, column_i_time AS column_i_time,
                (CAST((CAST(row_i_time AS DATE)-CAST(column_i_time AS DATE)) AS FLOAT) * 86400) +
                ((EXTRACT(HOUR FROM row_i_time) - EXTRACT(HOUR FROM column_i_time)) * 3600) +
                ((EXTRACT(MINUTE FROM row_i_time) - EXTRACT(MINUTE FROM column_i_time)) * 60) +
                ((EXTRACT(SECOND FROM row_i_time) - EXTRACT(SECOND FROM column_i_time)))
                 AS seconds from (select id,row_i_time,column_i_time from "Convolve2RealsLeft") as temp_table


 ************************* DataFrame *********************

                    row_i_time               column_i_time  seconds
id
1   2018-08-08 08:02:00.000000  2018-08-08 08:00:00.000000    120.0
1   2018-08-08 08:02:00.000000  2018-08-08 08:02:00.000000      0.0
1   2018-08-08 08:00:00.000000  2018-08-08 08:02:00.000000   -120.0
1   2018-08-08 08:00:00.000000  2018-08-08 08:00:00.000000      0.0

 ************************* DataFrame.dtypes *********************

id                             int
row_i_time       datetime.datetime
column_i_time    datetime.datetime
seconds                      float

### Truncate hours/minutes/seconds from Date and Round hours/minutes/seconds from Date.

In [79]:
# Load the data.
load_example_data("teradataml", "timestamp_data")
df = DataFrame("timestamp_data")
df = df.select(['id','timestamp_col1']).assign(col = df.timestamp_col1.to_timestamp())
print_variables(df)

WARNING: Skipped loading table timestamp_data since it already exists in the database.
Equivalent SQL: select id AS id, timestamp_col1 AS timestamp_col1, to_timestamp(timestamp_col1) AS col from (select id,timestamp_col1 from "timestamp_data") as temp_table


 ************************* DataFrame *********************

    timestamp_col1                         col
id
0           123456  1970-01-02 10:17:36.000000
2      45678910234  3417-07-05 02:10:34.000000
1           878986  1970-01-11 04:09:46.000000

 ************************* DataFrame.dtypes *********************

id                              int
timestamp_col1                  int
col               datetime.datetime

### Truncate minutes from date.

In [80]:
df1 = df.assign(res = df.col.trunc(formatter="MI"))
print_variables(df1)

Equivalent SQL: select id AS id, timestamp_col1 AS timestamp_col1, col AS col, trunc(col, 'MI') AS res from (select id AS id, timestamp_col1 AS timestamp_col1, to_timestamp(timestamp_col1) AS col from (select id,timestamp_col1 from "timestamp_data") as temp_table) as temp_table


 ************************* DataFrame *********************

    timestamp_col1                         col                         res
id
2      45678910234  3417-07-05 02:10:34.000000  3417-07-05 02:10:00.000000
1           878986  1970-01-11 04:09:46.000000  1970-01-11 04:09:00.000000
0           123456  1970-01-02 10:17:36.000000  1970-01-02 10:17:00.000000

 ************************* DataFrame.dtypes *********************

id                              int
timestamp_col1                  int
col               datetime.datetime
res                             str

### Round off minutes from date.

In [81]:
from sqlalchemy import func
from teradataml.dataframe.sql import _SQLColumnExpression
df1 = df.assign(res = _SQLColumnExpression(func.round(df.col.expression, 'MI')))
print_variables(df1)

Equivalent SQL: select id AS id, timestamp_col1 AS timestamp_col1, col AS col, round(col, 'MI') AS res from (select id AS id, timestamp_col1 AS timestamp_col1, to_timestamp(timestamp_col1) AS col from (select id,timestamp_col1 from "timestamp_data") as temp_table) as temp_table


 ************************* DataFrame *********************

    timestamp_col1                         col                         res
id
2      45678910234  3417-07-05 02:10:34.000000  3417-07-05 02:10:00.000000
1           878986  1970-01-11 04:09:46.000000  1970-01-11 04:09:00.000000
0           123456  1970-01-02 10:17:36.000000  1970-01-02 10:17:00.000000

 ************************* DataFrame.dtypes *********************

id                              int
timestamp_col1                  int
col               datetime.datetime
res                             str

### Truncate hours from date.

In [82]:
df1 = df.assign(res = df.col.trunc(formatter="HH"))
print_variables(df1)

Equivalent SQL: select id AS id, timestamp_col1 AS timestamp_col1, col AS col, trunc(col, 'HH') AS res from (select id AS id, timestamp_col1 AS timestamp_col1, to_timestamp(timestamp_col1) AS col from (select id,timestamp_col1 from "timestamp_data") as temp_table) as temp_table


 ************************* DataFrame *********************

    timestamp_col1                         col                         res
id
0           123456  1970-01-02 10:17:36.000000  1970-01-02 10:00:00.000000
2      45678910234  3417-07-05 02:10:34.000000  3417-07-05 02:00:00.000000
1           878986  1970-01-11 04:09:46.000000  1970-01-11 04:00:00.000000

 ************************* DataFrame.dtypes *********************

id                              int
timestamp_col1                  int
col               datetime.datetime
res                             str

### Round off hours from date.

In [83]:
from sqlalchemy import func
from teradataml.dataframe.sql import _SQLColumnExpression
df1 = df.assign(res = _SQLColumnExpression(func.round(df.col.expression, 'HH')))
print_variables(df1)

Equivalent SQL: select id AS id, timestamp_col1 AS timestamp_col1, col AS col, round(col, 'HH') AS res from (select id AS id, timestamp_col1 AS timestamp_col1, to_timestamp(timestamp_col1) AS col from (select id,timestamp_col1 from "timestamp_data") as temp_table) as temp_table


 ************************* DataFrame *********************

    timestamp_col1                         col                         res
id
2      45678910234  3417-07-05 02:10:34.000000  3417-07-05 02:00:00.000000
1           878986  1970-01-11 04:09:46.000000  1970-01-11 04:00:00.000000
0           123456  1970-01-02 10:17:36.000000  1970-01-02 10:00:00.000000

 ************************* DataFrame.dtypes *********************

id                              int
timestamp_col1                  int
col               datetime.datetime
res                             str

### Truncate years from date.

In [84]:
df1 = df_sales.assign(res = df_sales.dates.trunc(formatter="YYYY")).sort('accounts')
print_variables(df1)

Equivalent SQL: select accounts AS accounts, "Feb" AS "Feb", "Jan" AS "Jan", "Mar" AS "Mar", "Apr" AS "Apr", datetime AS datetime, dates AS dates, trunc(dates, 'YYYY') AS res from (select accounts AS accounts, "Feb" AS "Feb", "Jan" AS "Jan", "Mar" AS "Mar", "Apr" AS "Apr", datetime AS datetime, CASE WHEN (accounts = 'Alpha Co') THEN datetime + 191 WHEN (accounts = 'Blue Inc') THEN datetime + 56 WHEN (accounts = 'Jones LLC') THEN datetime + 440 WHEN (accounts = 'Orange Inc') THEN datetime + 395 WHEN (accounts = 'Yellow Inc') THEN datetime + 362 WHEN (accounts = 'Red Inc') THEN datetime + 233 END AS dates from "sales") as temp_table


 ************************* DataFrame *********************

              Feb    Jan    Mar    Apr    datetime     dates       res
accounts
Alpha Co    210.0  200.0  215.0  250.0  04/01/2017  17/07/14  17/01/01
Blue Inc     90.0   50.0   95.0  101.0  04/01/2017  17/03/01  17/01/01
Jones LLC   200.0  150.0  140.0  180.0  04/01/2017  18/03/20  18/01/01
Orange Inc  210.0    NaN    NaN  250.0  04/01/2017  18/02/03  18/01/01
Red Inc     200.0  150.0  140.0    NaN  04/01/2017  17/08/25  17/01/01
Yellow Inc   90.0    NaN    NaN    NaN  04/01/2017  18/01/01  18/01/01

 ************************* DataFrame.dtypes *********************

accounts              str
Feb                 float
Jan                   int
Mar                   int
Apr                   int
datetime    datetime.date
dates       datetime.date
res                   str

### Add a day to date.

In [85]:
df = df_sales.assign(res = df_sales.dates + df_sales.Jan.cast(INTERVAL_DAY(4)))
print_variables(df)

Equivalent SQL: select accounts AS accounts, "Feb" AS "Feb", "Jan" AS "Jan", "Mar" AS "Mar", "Apr" AS "Apr", datetime AS datetime, dates AS dates, dates + CAST("Jan" AS INTERVAL DAY(4)) AS res from (select accounts AS accounts, "Feb" AS "Feb", "Jan" AS "Jan", "Mar" AS "Mar", "Apr" AS "Apr", datetime AS datetime, CASE WHEN (accounts = 'Alpha Co') THEN datetime + 191 WHEN (accounts = 'Blue Inc') THEN datetime + 56 WHEN (accounts = 'Jones LLC') THEN datetime + 440 WHEN (accounts = 'Orange Inc') THEN datetime + 395 WHEN (accounts = 'Yellow Inc') THEN datetime + 362 WHEN (accounts = 'Red Inc') THEN datetime + 233 END AS dates from "sales") as temp_table


 ************************* DataFrame *********************

              Feb    Jan    Mar    Apr    datetime     dates       res
accounts
Alpha Co    210.0  200.0  215.0  250.0  04/01/2017  17/07/14  18/01/30
Blue Inc     90.0   50.0   95.0  101.0  04/01/2017  17/03/01  17/04/20
Jones LLC   200.0  150.0  140.0  180.0  04/01/2017  18/03/20  18/08/17
Orange Inc  210.0    NaN    NaN  250.0  04/01/2017  18/02/03      None
Yellow Inc   90.0    NaN    NaN    NaN  04/01/2017  18/01/01      None
Red Inc     200.0  150.0  140.0    NaN  04/01/2017  17/08/25  18/01/22

 ************************* DataFrame.dtypes *********************

accounts              str
Feb                 float
Jan                   int
Mar                   int
Apr                   int
datetime    datetime.date
dates       datetime.date
res         datetime.date

### Add a month to date.

In [86]:
df = df_sales.assign(res = df_sales.dates + df_sales.Jan.cast(INTERVAL_MONTH(4)))
print_variables(df)

Equivalent SQL: select accounts AS accounts, "Feb" AS "Feb", "Jan" AS "Jan", "Mar" AS "Mar", "Apr" AS "Apr", datetime AS datetime, dates AS dates, dates + CAST("Jan" AS INTERVAL MONTH(4)) AS res from (select accounts AS accounts, "Feb" AS "Feb", "Jan" AS "Jan", "Mar" AS "Mar", "Apr" AS "Apr", datetime AS datetime, CASE WHEN (accounts = 'Alpha Co') THEN datetime + 191 WHEN (accounts = 'Blue Inc') THEN datetime + 56 WHEN (accounts = 'Jones LLC') THEN datetime + 440 WHEN (accounts = 'Orange Inc') THEN datetime + 395 WHEN (accounts = 'Yellow Inc') THEN datetime + 362 WHEN (accounts = 'Red Inc') THEN datetime + 233 END AS dates from "sales") as temp_table


 ************************* DataFrame *********************

              Feb    Jan    Mar    Apr    datetime     dates       res
accounts
Blue Inc     90.0   50.0   95.0  101.0  04/01/2017  17/03/01  21/05/01
Red Inc     200.0  150.0  140.0    NaN  04/01/2017  17/08/25  30/02/25
Yellow Inc   90.0    NaN    NaN    NaN  04/01/2017  18/01/01      None
Jones LLC   200.0  150.0  140.0  180.0  04/01/2017  18/03/20  30/09/20
Orange Inc  210.0    NaN    NaN  250.0  04/01/2017  18/02/03      None
Alpha Co    210.0  200.0  215.0  250.0  04/01/2017  17/07/14  34/03/14

 ************************* DataFrame.dtypes *********************

accounts              str
Feb                 float
Jan                   int
Mar                   int
Apr                   int
datetime    datetime.date
dates       datetime.date
res         datetime.date

### Add an year to date.

In [87]:
df = df_sales.assign(res = df_sales.dates + df_sales.Jan.cast(INTERVAL_YEAR(4)))
print_variables(df)

Equivalent SQL: select accounts AS accounts, "Feb" AS "Feb", "Jan" AS "Jan", "Mar" AS "Mar", "Apr" AS "Apr", datetime AS datetime, dates AS dates, dates + CAST("Jan" AS INTERVAL YEAR(4)) AS res from (select accounts AS accounts, "Feb" AS "Feb", "Jan" AS "Jan", "Mar" AS "Mar", "Apr" AS "Apr", datetime AS datetime, CASE WHEN (accounts = 'Alpha Co') THEN datetime + 191 WHEN (accounts = 'Blue Inc') THEN datetime + 56 WHEN (accounts = 'Jones LLC') THEN datetime + 440 WHEN (accounts = 'Orange Inc') THEN datetime + 395 WHEN (accounts = 'Yellow Inc') THEN datetime + 362 WHEN (accounts = 'Red Inc') THEN datetime + 233 END AS dates from "sales") as temp_table


 ************************* DataFrame *********************

              Feb    Jan    Mar    Apr    datetime     dates       res
accounts
Blue Inc     90.0   50.0   95.0  101.0  04/01/2017  17/03/01  67/03/01
Red Inc     200.0  150.0  140.0    NaN  04/01/2017  17/08/25  67/08/25
Yellow Inc   90.0    NaN    NaN    NaN  04/01/2017  18/01/01      None
Jones LLC   200.0  150.0  140.0  180.0  04/01/2017  18/03/20  68/03/20
Orange Inc  210.0    NaN    NaN  250.0  04/01/2017  18/02/03      None
Alpha Co    210.0  200.0  215.0  250.0  04/01/2017  17/07/14  17/07/14

 ************************* DataFrame.dtypes *********************

accounts              str
Feb                 float
Jan                   int
Mar                   int
Apr                   int
datetime    datetime.date
dates       datetime.date
res         datetime.date

### Add an hour to date.

In [88]:
# Load the data.
load_example_data("teradataml", "timestamp_data")
df = DataFrame("timestamp_data")
df = df.select(['id','timestamp_col1']).assign(col = df.timestamp_col1.to_timestamp())
print_variables(df)

WARNING: Skipped loading table timestamp_data since it already exists in the database.
Equivalent SQL: select id AS id, timestamp_col1 AS timestamp_col1, to_timestamp(timestamp_col1) AS col from (select id,timestamp_col1 from "timestamp_data") as temp_table


 ************************* DataFrame *********************

    timestamp_col1                         col
id
0           123456  1970-01-02 10:17:36.000000
2      45678910234  3417-07-05 02:10:34.000000
1           878986  1970-01-11 04:09:46.000000

 ************************* DataFrame.dtypes *********************

id                              int
timestamp_col1                  int
col               datetime.datetime

In [89]:
df1 = df.assign(res = df.col + df.id.cast(INTERVAL_MINUTE(3)))
print_variables(df1)

Equivalent SQL: select id AS id, timestamp_col1 AS timestamp_col1, col AS col, col + CAST(id AS INTERVAL MINUTE(3)) AS res from (select id AS id, timestamp_col1 AS timestamp_col1, to_timestamp(timestamp_col1) AS col from (select id,timestamp_col1 from "timestamp_data") as temp_table) as temp_table


 ************************* DataFrame *********************

    timestamp_col1                         col                         res
id
0           123456  1970-01-02 10:17:36.000000  1970-01-02 10:17:36.000000
2      45678910234  3417-07-05 02:10:34.000000  3417-07-05 02:12:34.000000
1           878986  1970-01-11 04:09:46.000000  1970-01-11 04:10:46.000000

 ************************* DataFrame.dtypes *********************

id                              int
timestamp_col1                  int
col               datetime.datetime
res               datetime.datetime

<b style = 'font-size:28px;font-family:Arial;color:#E37C4D'>Remove connection</b>

In [90]:
remove_context()

True